nicolas-codemate/esp32-pixelcast/src/main.cpp
// Tracker Data (populated by POST /api/tracker)
struct TrackerData {
    char name[16];            // Key: "btc", "eth", "aapl"
    // Scrolls when it overflows, so the cap is storage rather than screen width: 64 bytes
    // hold 31 characters whatever their encoding, an accented one taking two.
    char symbol[64];
    char icon[32];            // Icon name (LittleFS)
    char currencySymbol[8];   // "USD", "EUR"
    float currentValue;       // Price/value
    float changePercent;      // +2.14 or -1.5
    uint16_t sparkline[MAX_SPARKLINE_POINTS];  // Scaled 0-65535
    uint8_t sparklineCount;
    uint32_t symbolColor;     // Header color (0xRRGGBB)
    uint32_t sparklineColor;  // Chart color
    // Same reasoning as symbol: 64 bytes hold 31 characters whatever their encoding
    char bottomText[64];      // Optional footer - scrolls when it overflows
    TextSegment bottomTextSegments[MAX_TEXT_SEGMENTS];
    uint8_t bottomTextSegmentCount;
    char sparklinePeriod[8];  // Chart period label, e.g. "24h", "7d"
    unsigned long lastUpdate;
    bool valid;
};
TrackerData trackers[MAX_TRACKERS];
uint8_t trackerCount = 0;

// Indicator Data
enum IndicatorMode : uint8_t {
    INDICATOR_OFF = 0,
    INDICATOR_SOLID = 1,
    INDICATOR_BLINK = 2,
    INDICATOR_FADE = 3
};

struct IndicatorData {
    IndicatorMode mode;
    uint32_t color;          // 0xRRGGBB
    uint16_t blinkInterval;  // ms (default INDICATOR_BLINK_INTERVAL)
    uint16_t fadePeriod;     // ms (default INDICATOR_FADE_PERIOD)
};
IndicatorData indicators[NUM_INDICATORS];

struct IndicatorAnimState {
    unsigned long lastToggle;
    bool blinkOn;
    unsigned long cycleStart;
};
IndicatorAnimState indicatorAnimState[NUM_INDICATORS];

// Notification Data
struct NotificationItem {
    char id[24];              // Unique ID ("notif_<millis>" or user-provided)
    char text[128];           // Notification text (longer than app's 64 chars)
    char icon[32];            // Icon filename
    uint32_t textColor;       // RGB color
    uint32_t backgroundColor; // RGB color for area outside card frame (0 = none)
    uint16_t duration;        // Display duration in ms (0 = hold mode)
    bool hold;                // Explicit hold flag (never auto-expires)
    bool urgent;              // Jumps to front of queue
    bool stack;               // Queue sequentially (true) vs replace current (false)
    bool active;              // Slot in use
    unsigned long displayedAt; // Timestamp when first displayed (0 = not yet shown)
};
NotificationItem notifications[MAX_NOTIFICATIONS];
uint8_t notificationCount = 0;
int8_t currentNotifIndex = -1;
int8_t savedAppIndex = -1;          // App to restore after notifications end
ScrollState notifScrollState;

// Timing
unsigned long lastMqttReconnectAttempt = 0;
unsigned long lastStatsPublish = 0;
unsigned long lastDisplayUpdate = 0;
unsigned long lastTimeUpdate = 0;

// Forecast pagination
uint8_t forecastPage = 0;
unsigned long lastForecastPageSwitch = 0;

// Weather display cache (global so they can be reset on app switch)
int weatherLastDrawnMinute = -1;
unsigned long weatherLastUpdateDrawn = 0;
uint8_t weatherFullRepaintsPending = 0;
uint8_t weatherForecastRepaintsPending = 0;

// Tracker display cache (global so they can be reset on app switch)
unsigned long trackerLastUpdateDrawn = 0;
bool trackerBadgeDrawn = false;
bool trackerDimDrawn = false;
bool trackerIconDrawn = false;
uint8_t trackerFullRepaintsPending = 0;

// A screen arms one of these counters when its content changes and spends one unit per full
// paint, so the change reaches every buffer before a partial repaint is allowed to run.
bool consumePendingRepaint(uint8_t& pendingRepaints) {
    if (pendingRepaints == 0) return false;
    pendingRepaints--;
    return true;
}

// The symbol and the bottom text scroll independently, so they each carry their own state.
// Both are written by the render pass and read by loopDisplay; the REST handler can rewrite
// the underlying text from the web server task mid-frame, which costs at worst one torn
// frame, repaired 50 ms later.
ScrollState trackerSymbolScrollState;
ScrollState trackerBottomScrollState;

// Icon Upload State
File uploadFile;
String uploadIconName;
bool uploadValid = false;
size_t uploadSize = 0;

// Icons Web Interface HTML (stored in PROGMEM to save RAM)
const char ICONS_HTML[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
    <title>PixelCast Icons</title>
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <style>
        body { font-family: sans-serif; max-width: 800px; margin: 0 auto; padding: 20px; background: #1a1a2e; color: #eee; }
        h1 { color: #00aaff; }
        h2 { color: #888; border-bottom: 1px solid #333; padding-bottom: 8px; }
        .grid { display: grid; grid-template-columns: repeat(auto-fill, minmax(100px, 1fr)); gap: 15px; }
        .icon { text-align: center; padding: 15px; background: #16213e; border-radius: 8px; position: relative; }
        .icon img { width: 48px; height: 48px; image-rendering: pixelated; background: #000; }
        .icon .name { margin-top: 8px; font-size: 12px; word-break: break-all; }
        .icon .size { font-size: 10px; color: #666; }
        .icon button { position: absolute; top: 5px; right: 5px; background: #ff4444; border: none; color: white; width: 20px; height: 20px; border-radius: 50%; cursor: pointer; font-size: 12px; }
        .icon button:hover { background: #ff6666; }
        input, button { padding: 10px 15px; margin: 5px; border: none; border-radius: 4px; }
        input[type="text"], input[type="number"] { background: #0f3460; color: #eee; width: 150px; }
        input[type="file"] { background: #0f3460; color: #eee; }
        button { background: #00aaff; color: white; cursor: pointer; }
        button:hover { background: #0088cc; }
        button:disabled { background: #444; cursor: not-allowed; }
        section { margin-bottom: 30px; padding: 20px; background: #16213e; border-radius: 8px; }
        a { color: #00aaff; }
        .storage { font-size: 12px; color: #888; margin-top: 10px; }
        .msg { padding: 10px; border-radius: 4px; margin: 10px 0; display: none; }
        .msg.success { background: #1a4d1a; color: #4caf50; display: block; }
        .msg.error { background: #4d1a1a; color: #f44336; display: block; }
        .loading { opacity: 0.5; pointer-events: none; }
    </style>
</head>
<body>
    <h1>PixelCast Icons</h1>
    <div id="msg" class="msg"></div>

