nicolas-codemate/esp32-pixelcast/src/main.cpp
    strlcpy(notif->text, text, sizeof(notif->text));
    if (icon) {
        strlcpy(notif->icon, icon, sizeof(notif->icon));
    }

    notif->textColor = textColor;
    notif->backgroundColor = bgColor;
    notif->duration = duration;
    notif->hold = hold;
    notif->urgent = urgent;
    notif->stack = stack;
    notif->active = true;
    notif->displayedAt = 0;  // Not yet shown

    notificationCount++;

    // If urgent, force it to be picked up next
    if (urgent) {
        currentNotifIndex = freeSlot;
    }

    Serial.printf("[NOTIF] Added: %s (duration=%d, hold=%d, urgent=%d, stack=%d)\n",
                  notif->id, duration, hold, urgent, stack);
    return freeSlot;
}

bool notifDismiss() {
    if (currentNotifIndex < 0 || !notifications[currentNotifIndex].active) {
        return false;
    }

    Serial.printf("[NOTIF] Dismissed: %s\n", notifications[currentNotifIndex].id);
    notifications[currentNotifIndex].active = false;
    notificationCount--;
    currentNotifIndex = -1;
    return true;
}

void notifClearAll() {
    for (uint8_t i = 0; i < MAX_NOTIFICATIONS; i++) {
        notifications[i].active = false;
    }
    notificationCount = 0;
    currentNotifIndex = -1;
    Serial.println("[NOTIF] Cleared all");
}

NotificationItem* notifGetCurrent() {
    if (currentNotifIndex >= 0 && notifications[currentNotifIndex].active) {
        return &notifications[currentNotifIndex];
    }
    return nullptr;
}

NotificationItem* notifGetNext() {
    if (notificationCount == 0) return nullptr;

    // First pass: find urgent notifications not yet displayed
    for (uint8_t i = 0; i < MAX_NOTIFICATIONS; i++) {
        if (notifications[i].active && notifications[i].urgent && notifications[i].displayedAt == 0) {
            currentNotifIndex = i;
            return &notifications[i];
        }
    }

    // Second pass: find any active notification not yet displayed
    for (uint8_t i = 0; i < MAX_NOTIFICATIONS; i++) {
        if (notifications[i].active && notifications[i].displayedAt == 0) {
            currentNotifIndex = i;
            return &notifications[i];
        }
    }

    return nullptr;
}

bool notifIsExpired(NotificationItem* notif) {
    if (!notif || !notif->active) return true;
    if (notif->hold || notif->duration == 0) return false;
    if (notif->displayedAt == 0) return false;  // Not yet shown
    return (millis() - notif->displayedAt) > notif->duration;
}

// Parse color from JSON (hex string "#FF8800", RGB array [255,136,0], or raw uint32)
uint32_t parseColorValue(JsonVariant colorVar, uint32_t defaultColor) {
    if (colorVar.isNull()) return defaultColor;

    if (colorVar.is<JsonArray>()) {
        JsonArray arr = colorVar.as<JsonArray>();
        if (arr.size() == 3) {
            return ((uint32_t)arr[0].as<uint8_t>() << 16) |
                   ((uint32_t)arr[1].as<uint8_t>() << 8) |
                   (uint32_t)arr[2].as<uint8_t>();
        }
    } else if (colorVar.is<const char*>()) {
        const char* str = colorVar.as<const char*>();
        if (str[0] == '#') str++;
        return strtoul(str, NULL, 16);
    } else {
        return colorVar.as<uint32_t>();
    }
    return defaultColor;
}

// Format a uint32 color (0xRRGGBB) as hex string "#RRGGBB" into a buffer
void formatColorHex(uint32_t color, char* buffer, size_t bufSize) {
    snprintf(buffer, bufSize, "#%02X%02X%02X",
             (uint8_t)((color >> 16) & 0xFF),
             (uint8_t)((color >> 8) & 0xFF),
             (uint8_t)(color & 0xFF));
}

// Read a "hide" | "dim" | "badge" | "none" name. Returns false when the field is missing or
// holds an unknown name, leaving it to the caller to tell an absent field from a bad one.
bool parseStaleBehavior(JsonVariant value, StaleBehavior* behavior) {
    if (!value.is<const char*>()) return false;

    const char* name = value.as<const char*>();
    if (strcmp(name, "hide") == 0)  { *behavior = STALE_HIDE;  return true; }
    if (strcmp(name, "dim") == 0)   { *behavior = STALE_DIM;   return true; }
    if (strcmp(name, "badge") == 0) { *behavior = STALE_BADGE; return true; }
    if (strcmp(name, "none") == 0)  { *behavior = STALE_NONE;  return true; }
    return false;
}

const char* staleBehaviorName(StaleBehavior behavior) {
    switch (behavior) {
        case STALE_DIM:   return "dim";
        case STALE_BADGE: return "badge";
        case STALE_NONE:  return "none";
        default:          return "hide";
    }
}

// Clients express the tolerated silence in seconds; everything downstream compares against
// millis(). The cap keeps the conversion inside uint32 and well clear of the millis() wrap.
uint32_t staleAfterSecondsToMillis(uint32_t seconds) {
    if (seconds > MAX_STALE_AFTER_SECONDS) seconds = MAX_STALE_AFTER_SECONDS;
    return seconds * 1000UL;
}

bool appIsStale(const AppItem* app) {
    if (!app || app->staleAfter == 0) return false;
    return (millis() - app->lastUpdate) > app->staleAfter;
}

// Parse polymorphic text field: string, {text,color} object, or [{t,c},...] array
void parseTextFieldWithSegments(JsonVariant field, char* textBuffer, size_t textBufferSize,
                                TextSegment* segments, uint8_t* segmentCount, uint32_t defaultColor) {
    *segmentCount = 0;
    textBuffer[0] = '\0';

    if (field.isNull()) return;

    // Simple string: "text"
    if (field.is<const char*>()) {
        strlcpy(textBuffer, field.as<const char*>(), textBufferSize);
        return;
    }

    // Object with text and color: {"text": "hello", "color": "#FF0000"}
    if (field.is<JsonObject>()) {
        JsonObject obj = field.as<JsonObject>();
        strlcpy(textBuffer, obj["text"] | "", textBufferSize);
        if (!obj["color"].isNull()) {
            segments[0].offset = 0;
            segments[0].color = parseColorValue(obj["color"], defaultColor);
            *segmentCount = 1;
        }
        return;
    }

    // Array of segments: [{"t": "22.5", "c": "#FF8800"}, {"t": "C", "c": "#666666"}]
    if (field.is<JsonArray>()) {
        JsonArray arr = field.as<JsonArray>();
        size_t pos = 0;
        uint8_t count = 0;
        for (JsonObject seg : arr) {
            if (count >= MAX_TEXT_SEGMENTS) break;
            const char* t = seg["t"] | "";
            size_t tLen = strlen(t);
            if (pos + tLen >= textBufferSize) break;

            // Record segment offset and color
            segments[count].offset = (uint8_t)pos;
            segments[count].color = parseColorValue(seg["c"], defaultColor);
            count++;

            // Concatenate text
            memcpy(textBuffer + pos, t, tLen);
            pos += tLen;
        }
        textBuffer[pos] = '\0';
        *segmentCount = count;
        return;
    }
}

