nicolas-codemate/esp32-pixelcast/src/main.cpp
// Serialize text field in polymorphic format for JSON output
void serializeTextField(JsonObject& obj, const char* fieldName, const char* text,
                        const TextSegment* segments, uint8_t segmentCount) {
    if (segmentCount == 0) {
        obj[fieldName] = text;
        return;
    }

    // Build array of {t, c} segments
    JsonArray arr = obj[fieldName].to<JsonArray>();
    size_t textLen = strlen(text);
    for (uint8_t i = 0; i < segmentCount; i++) {
        JsonObject seg = arr.add<JsonObject>();
        // Extract substring from offset to next segment (or end)
        size_t start = segments[i].offset;
        size_t end = (i + 1 < segmentCount) ? segments[i + 1].offset : textLen;
        if (start >= textLen) break;
        if (end > textLen) end = textLen;

        // Copy substring
        char buf[64];
        size_t len = end - start;
        if (len >= sizeof(buf)) len = sizeof(buf) - 1;
        memcpy(buf, text + start, len);
        buf[len] = '\0';
        seg["t"] = (const char*)buf;

        char colorHex[8];
        formatColorHex(segments[i].color, colorHex, sizeof(colorHex));
        seg["c"] = (const char*)colorHex;
    }
}

// Draw sparkline chart from scaled uint16 data
void drawSparkline(const uint16_t* data, uint8_t count, int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color) {
    if (count < 2) return;

    // Find data min/max for vertical scaling
    uint16_t dataMin = 65535;
    uint16_t dataMax = 0;
    for (uint8_t i = 0; i < count; i++) {
        if (data[i] < dataMin) dataMin = data[i];
        if (data[i] > dataMax) dataMax = data[i];
    }

    uint16_t dataRange = dataMax - dataMin;
    if (dataRange == 0) dataRange = 1;

    // Plot line segments between consecutive points
    for (uint8_t i = 0; i < count - 1; i++) {
        int16_t x0 = x + (int32_t)i * (w - 1) / (count - 1);
        int16_t x1 = x + (int32_t)(i + 1) * (w - 1) / (count - 1);
        // Invert Y: high value = top of chart
        int16_t y0 = y + h - 1 - (int32_t)(data[i] - dataMin) * (h - 1) / dataRange;
        int16_t y1 = y + h - 1 - (int32_t)(data[i + 1] - dataMin) * (h - 1) / dataRange;
        dma_display->drawLine(x0, y0, x1, y1, color);
    }
}

// Draw a small up/down arrow (5x5 pixels)
void drawTrackerArrow(int16_t x, int16_t y, bool up, uint16_t color) {
    if (up) {
        //   ..X..
        //   .XXX.
        //   XXXXX
        //   ..X..
        //   ..X..
        dma_display->drawPixel(x + 2, y,     color);
        dma_display->drawPixel(x + 1, y + 1, color);
        dma_display->drawPixel(x + 2, y + 1, color);
        dma_display->drawPixel(x + 3, y + 1, color);
        for (int16_t i = 0; i < 5; i++) dma_display->drawPixel(x + i, y + 2, color);
        dma_display->drawPixel(x + 2, y + 3, color);
        dma_display->drawPixel(x + 2, y + 4, color);
    } else {
        //   ..X..
        //   ..X..
        //   XXXXX
        //   .XXX.
        //   ..X..
        dma_display->drawPixel(x + 2, y,     color);
        dma_display->drawPixel(x + 2, y + 1, color);
        for (int16_t i = 0; i < 5; i++) dma_display->drawPixel(x + i, y + 2, color);
        dma_display->drawPixel(x + 1, y + 3, color);
        dma_display->drawPixel(x + 2, y + 3, color);
        dma_display->drawPixel(x + 3, y + 3, color);
        dma_display->drawPixel(x + 2, y + 4, color);
    }
}

// The default 5x7 font occupies a 6x8 cell: five columns of glyph plus one of spacing.
#define TEXT_CELL_WIDTH  6
#define TEXT_CELL_HEIGHT 8

// A float holds about seven significant digits. Printing more turns the binary rounding of
// the stored value into digits the caller never sent: 6.232 comes back as 6.2319999.
#define FLOAT_SIGNIFICANT_DIGITS 7

// Decimals kept even when they are zero, because a price reads as a price with its cents.
#define TRACKER_VALUE_MIN_DECIMALS 2

void insertThousandSeparators(const char* digits, char* buffer, size_t bufSize) {
    int digitCount = strlen(digits);
    int separatorCount = (digitCount - 1) / 3;
    int totalLength = digitCount + separatorCount;
    if ((size_t)totalLength >= bufSize) {
        strlcpy(buffer, digits, bufSize);
        return;
    }

    buffer[totalLength] = '\0';
    int sourceIndex = digitCount - 1;
    int destinationIndex = totalLength - 1;
    int writtenDigits = 0;
    while (sourceIndex >= 0) {
        buffer[destinationIndex--] = digits[sourceIndex--];
        writtenDigits++;
        if (writtenDigits % 3 == 0 && sourceIndex >= 0) {
            buffer[destinationIndex--] = ',';
        }
    }
}

// Fills maxChars with as many decimals as the value carries, so a fund quoted at 6.232 keeps
// its third decimal instead of being rounded to 6.23.
void formatTrackerValue(float value, char* buffer, size_t bufSize, uint8_t maxChars) {
    if (bufSize == 0) return;
    if ((size_t)maxChars >= bufSize) maxChars = bufSize - 1;

    bool isNegative = value < 0.0f;
    float magnitude = isNegative ? -value : value;

    int integerDigitCount = 1;
    for (uint32_t remaining = (uint32_t)magnitude; remaining >= 10; remaining /= 10) {
        integerDigitCount++;
    }

    uint8_t leadingZeros = 0;
    if (magnitude > 0.0f && magnitude < 1.0f) {
        for (float scaled = magnitude; scaled < 0.1f; scaled *= 10.0f) {
            leadingZeros++;
        }
    }

    // Leading zeros say nothing about the value, so they cost none of its significant digits.
    int decimals = magnitude >= 1.0f
        ? FLOAT_SIGNIFICANT_DIGITS - integerDigitCount
        : FLOAT_SIGNIFICANT_DIGITS + leadingZeros;
    if (decimals < 0) decimals = 0;

    // Rounding can carry into the integer part, so what fits is read off the formatted string
    // rather than predicted from the value: 9,999.99 at one decimal becomes 10,000.0.
    size_t length;
    do {
        char plainValue[24];
        snprintf(plainValue, sizeof(plainValue), "%.*f", decimals, magnitude);

        char* fraction = strchr(plainValue, '.');
        if (fraction) {
            *fraction++ = '\0';
            // Dropping every trailing zero would leave 0.00 for a value whose first
            // significant digit sits further right than the room allows.
            int minimumDecimals = leadingZeros + 1;
            if (minimumDecimals < TRACKER_VALUE_MIN_DECIMALS) minimumDecimals = TRACKER_VALUE_MIN_DECIMALS;
            if (minimumDecimals > decimals) minimumDecimals = decimals;

            int keptDecimals = strlen(fraction);
            while (keptDecimals > minimumDecimals && fraction[keptDecimals - 1] == '0') {
                fraction[--keptDecimals] = '\0';
            }
        }

        char separatedInteger[24];
        insertThousandSeparators(plainValue, separatedInteger, sizeof(separatedInteger));

        bool hasFraction = fraction && *fraction;
        snprintf(buffer, bufSize, "%s%s%s%s",
                 isNegative ? "-" : "",
                 separatedInteger,
                 hasFraction ? "." : "",
                 hasFraction ? fraction : "");
        length = strlen(buffer);
    } while (length > maxChars && decimals-- > 0);
}

// Tracker row geometry. The header and footer coordinates are shared by the full redraw and
// the scroll repaints.
#define TRACKER_HEADER_HEIGHT       12
#define TRACKER_SYMBOL_X            13
#define TRACKER_SYMBOL_X_NO_ICON    2
#define TRACKER_SYMBOL_Y            4
#define TRACKER_STALE_BADGE_X       42
#define TRACKER_VALUE_X             2
#define TRACKER_CURRENCY_RIGHT_X    62
// Without it the last digit sits one pixel from the currency, the same gap that separates two
// digits, and the two read as one run: "1,234.57EUR".
#define TRACKER_VALUE_GUTTER        2
#define TRACKER_PERIOD_RIGHT_X      62
#define TRACKER_BOTTOM_Y            56

// --- Row 1, the symbol alone (y=0..11) ---
// Runs every scroll step, and the DMA reads this framebuffer while it is being written, so it
// touches nothing outside the strip the name moves in: clearing the icon to paint it back
// identically twenty times a second is seen as flicker.
void displayDrawTrackerSymbol(TrackerData* tracker, bool showBadge, bool dimColors) {
    uint16_t black = dma_display->color565(0, 0, 0);

    // Taken from the last full redraw rather than the cache, so an icon evicted mid-scroll
    // cannot shift the name sideways
    int16_t symbolAreaX = trackerIconDrawn ? TRACKER_SYMBOL_X : TRACKER_SYMBOL_X_NO_ICON;
    int16_t symbolAreaEnd = showBadge ? TRACKER_STALE_BADGE_X - 1 : DISPLAY_WIDTH;

    dma_display->fillRect(symbolAreaX, 0, symbolAreaEnd - symbolAreaX, TRACKER_HEADER_HEIGHT, black);

    // drawIndicators skips a blinking indicator in its off phase instead of erasing it, so the
    // corners it owns are cleared here for it to blink at all - and only while it is in use,
    // since the top-left one sits over the icon
    for (uint8_t corner = 0; corner < 2; corner++) {
        if (indicators[corner].mode == INDICATOR_OFF) continue;
        int16_t cornerX = (corner == 0) ? 0 : DISPLAY_WIDTH - INDICATOR_FOOTPRINT;
        dma_display->fillRect(cornerX, 0, INDICATOR_FOOTPRINT, INDICATOR_FOOTPRINT, black);

