nicolas-codemate/esp32-pixelcast/src/main.cpp
        if (corner == 0 && trackerIconDrawn) {
            // Cache-only lookup: getIcon would fall back to a filesystem read, 20 times a second
            drawIconAtScale(getCachedIcon(tracker->icon), 2, 2, 1);
        }
    }

    scrollStateArm(trackerSymbolScrollState, calculateTextWidth(tracker->symbol),
                   symbolAreaEnd - symbolAreaX);

    int16_t symbolX = symbolAreaX;
    if (trackerSymbolScrollState.needsScroll) {
        symbolX -= trackerSymbolScrollState.scrollOffset;
    }

    uint32_t symbolColor = dimColors ? dimColorQuarter(tracker->symbolColor) : tracker->symbolColor;

    dma_display->setFont(NULL);  // Default 5x7 font
    dma_display->setTextSize(1);
    printTextWithinBounds(tracker->symbol, symbolX, TRACKER_SYMBOL_Y,
                          symbolAreaX, symbolAreaEnd, symbolColor);
}

// --- Row 1: icon + symbol (y=0..11) ---
// The band starts at y=0 so a blinking indicator that went dark does not stay lit.
void displayDrawTrackerHeader(TrackerData* tracker, bool showBadge, bool dimColors, CachedIcon* icon) {
    dma_display->fillRect(0, 0, DISPLAY_WIDTH, TRACKER_HEADER_HEIGHT, dma_display->color565(0, 0, 0));

    trackerIconDrawn = (icon && icon->valid);
    if (trackerIconDrawn) {
        drawIconAtScale(icon, 2, 2, 1);
    }

    if (showBadge) {
        dma_display->setFont(&TomThumb);
        dma_display->setTextColor(dma_display->color565(200, 0, 0));
        dma_display->setCursor(TRACKER_STALE_BADGE_X, 6);
        dma_display->print("STALE");
    }

    displayDrawTrackerSymbol(tracker, showBadge, dimColors);

    // Contract for the rows drawn after this one: default font, size 1
    dma_display->setFont(NULL);
    dma_display->setTextSize(1);
}

// --- Bottom text (y=56..63) ---
void displayDrawTrackerBottom(TrackerData* tracker, bool dimColors) {
    dma_display->fillRect(0, TRACKER_BOTTOM_Y, DISPLAY_WIDTH,
                          DISPLAY_HEIGHT - TRACKER_BOTTOM_Y, dma_display->color565(0, 0, 0));

    if (strlen(tracker->bottomText) == 0) {
        return;
    }

    int16_t textWidth = calculateTomThumbTextWidth(tracker->bottomText);
    scrollStateArm(trackerBottomScrollState, textWidth, DISPLAY_WIDTH - 4);

    int16_t textX;
    if (trackerBottomScrollState.needsScroll) {
        textX = 2 - trackerBottomScrollState.scrollOffset;
    } else {
        textX = (DISPLAY_WIDTH - textWidth) / 2;
    }

    // A dimmed screen dims every colour it shows, segments included
    TextSegment dimmedSegments[MAX_TEXT_SEGMENTS];
    const TextSegment* segments = tracker->bottomTextSegments;
    if (dimColors && tracker->bottomTextSegmentCount > 0) {
        for (uint8_t i = 0; i < tracker->bottomTextSegmentCount; i++) {
            dimmedSegments[i] = tracker->bottomTextSegments[i];
            dimmedSegments[i].color = dimColorQuarter(dimmedSegments[i].color);
        }
        segments = dimmedSegments;
    }

    // dimDefault would apply a 3/4 factor that no input colour turns back into the grey this
    // row has always used, so the grey is passed in directly
    printLabelWithSegments(tracker->bottomText, textX, 62,
                           dimColors ? TRACKER_BOTTOM_COLOR_STALE : TRACKER_BOTTOM_COLOR,
                           segments, tracker->bottomTextSegmentCount, false);
}

// Display tracker layout on 64x64 matrix
void displayShowTracker(TrackerData* tracker, const AppItem* app) {
    if (!tracker) return;

    // Kept apart so "badge" can flag a closing price as frozen while leaving it readable
    bool isStale = appIsStale(app);
    bool showBadge = isStale && (app->staleBehavior == STALE_DIM || app->staleBehavior == STALE_BADGE);
    bool dimColors = isStale && app->staleBehavior == STALE_DIM;

    // A tracker screen shows a fixed snapshot, and a full paint costs an icon lookup plus the
    // whole layout, so it only runs when the data arrives or goes stale.
    bool contentChanged = (trackerLastUpdateDrawn != tracker->lastUpdate) ||
                          (trackerBadgeDrawn != showBadge) ||
                          (trackerDimDrawn != dimColors);

    if (contentChanged) {
        trackerLastUpdateDrawn = tracker->lastUpdate;
        trackerBadgeDrawn = showBadge;
        trackerDimDrawn = dimColors;
        trackerFullRepaintsPending = DISPLAY_BUFFER_COUNT;
    }

    if (!consumePendingRepaint(trackerFullRepaintsPending)) {
        if (trackerSymbolScrollState.needsScroll) {
            displayDrawTrackerSymbol(tracker, showBadge, dimColors);
        }
        if (trackerBottomScrollState.needsScroll) {
            displayDrawTrackerBottom(tracker, dimColors);
        }
        drawIndicators();
        #if DOUBLE_BUFFER
            dma_display->flipDMABuffer();
        #endif
        return;
    }

    dma_display->clearScreen();

    // Color helpers
    uint16_t white = dma_display->color565(255, 255, 255);
    uint16_t dimWhite = dimColors ? dma_display->color565(60, 60, 60) : dma_display->color565(150, 150, 150);
    uint16_t dimGray = dma_display->color565(40, 40, 40);
    uint16_t green = dimColors ? dma_display->color565(0, 60, 0) : dma_display->color565(0, 200, 0);
    uint16_t red = dimColors ? dma_display->color565(60, 0, 0) : dma_display->color565(200, 0, 0);

    uint8_t spkR = (tracker->sparklineColor >> 16) & 0xFF;
    uint8_t spkG = (tracker->sparklineColor >> 8) & 0xFF;
    uint8_t spkB = tracker->sparklineColor & 0xFF;
    uint16_t sparklineColor565 = dimColors
        ? dma_display->color565(spkR / 4, spkG / 4, spkB / 4)
        : dma_display->color565(spkR, spkG, spkB);

    uint16_t valueColor = dimColors ? dma_display->color565(60, 60, 60) : white;

    displayDrawTrackerHeader(tracker, showBadge, dimColors, getIcon(tracker->icon));

    // --- Row 2: Price value (y=14..22) ---
    bool hasCurrency = strlen(tracker->currencySymbol) > 0;
    int16_t currencyX = TRACKER_CURRENCY_RIGHT_X - calculateTomThumbTextWidth(tracker->currencySymbol);
    int16_t valueAreaEnd = hasCurrency ? currencyX - TRACKER_VALUE_GUTTER : DISPLAY_WIDTH;
    uint8_t valueMaxChars = (valueAreaEnd - TRACKER_VALUE_X) / TEXT_CELL_WIDTH;

