nicolas-codemate/esp32-pixelcast/src/main.cpp
        // ---- Separator (y=31) ----
        drawSeparatorLine(31, dimGray);
    }

    // ---- Forecast (y=33-63) - redrawn on full redraw or page change ----
    if (needsForecastRedraw) {
        dma_display->fillRect(0, 32, DISPLAY_WIDTH, 32, black);

        if (hasHourlyPage && currentPage == 0) {
            displayShowTodayChart(&weatherData.today);
        } else {
            // Compute which forecast days to display on the current page
            uint8_t dayPage = hasHourlyPage ? (currentPage - 1) : currentPage;
            uint8_t pageStart = dayPage * FORECAST_COLUMNS;
            uint8_t displayCount = (pageStart < weatherData.forecastCount)
                ? min((uint8_t)FORECAST_COLUMNS,
                      (uint8_t)(weatherData.forecastCount - pageStart))
                : 0;

            for (int col = 0; col < displayCount; col++) {
                int forecastIndex = pageStart + col;

                // Dynamic centering based on number of columns on this page
                int16_t colCenter;
                if (displayCount == 1) {
                    colCenter = 32;
                } else if (displayCount == 2) {
                    colCenter = 16 + col * 32;
                } else {
                    colCenter = 11 + col * 21;
                }

                // Day name (TomThumb baseline=39, glyphs y=34-38)
                dma_display->setFont(&TomThumb);
                dma_display->setTextColor(coral);
                int16_t dayNameWidth = calculateTomThumbTextWidth(weatherData.forecast[forecastIndex].dayName);
                dma_display->setCursor(colCenter - dayNameWidth / 2, 39);
                dma_display->print(weatherData.forecast[forecastIndex].dayName);

                // Forecast icon (8x8 native, y=41-48)
                const uint16_t* builtinForecastIcon = getBuiltinWeatherIcon(weatherData.forecast[forecastIndex].icon);
                if (builtinForecastIcon) {
                    drawProgmemIcon(dma_display, builtinForecastIcon, colCenter - 4, 41, 1);
                } else {
                    CachedIcon* forecastIcon = getIcon(weatherData.forecast[forecastIndex].icon);
                    if (forecastIcon && forecastIcon->valid) {
                        drawIconAtScale(forecastIcon, colCenter - 4, 41, 1);
                    }
                }

                // Min temp in blue (TomThumb baseline=56, glyphs y=51-55)
                drawCenteredTemperature(colCenter, 56,
                                        weatherData.forecast[forecastIndex].tempMin, coldBlue);

                // Max temp in red (TomThumb baseline=63, glyphs y=58-62)
                drawCenteredTemperature(colCenter, 63,
                                        weatherData.forecast[forecastIndex].tempMax, warmRed);
            }
        }

        // Page indicator squares (vertical, right edge, just below second separator)
        if (forecastPageCount > 1) {
            uint16_t activeDot = dma_display->color565(120, 60, 200);  // Dark violet
            int squareSize = 2;
            int gap = 1;
            int step = squareSize + gap;  // 3px per indicator
            int dotX = 61;               // 2px margin from right edge (x=63)
            int dotStartY = 33;          // Just below separator at y=31
            for (int d = 0; d < forecastPageCount; d++) {
                uint16_t dotColor = (d == currentPage) ? activeDot : dimGray;
                dma_display->fillRect(dotX, dotStartY + d * step, squareSize, squareSize, dotColor);
            }
        }
    }

    // ---- Clock (y=13-20) - redrawn every second ----
    // Clear only the clock region (y=11 to y=20) to avoid full-screen flicker
    dma_display->fillRect(0, 11, DISPLAY_WIDTH, 10, black);

    dma_display->setTextColor(mintGreen);

    // HH:MM in NULL font (5 chars * 6px = 30px)
    char hmStr[6];
    snprintf(hmStr, sizeof(hmStr), "%02d:%02d", hours, minutes);
    dma_display->setFont(NULL);
    dma_display->setTextSize(1);

    int16_t hmX = (DISPLAY_WIDTH - 30) / 2 - 6;  // Shift left for seconds
    dma_display->setCursor(hmX, 13);
    dma_display->print(hmStr);

    // Seconds in TomThumb (baseline=20, bottom-aligned with NULL font y=13+6=19)
    dma_display->setFont(&TomThumb);
    char secStr[4];
    snprintf(secStr, sizeof(secStr), ":%02d", seconds);
    dma_display->setCursor(hmX + 31, 20);
    dma_display->print(secStr);

    // Reset font
    dma_display->setFont(NULL);

    drawIndicators();

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

void displayShowApp(AppItem* app) {
    if (!app) return;

    // Detect app switch and clear screen to prevent ghosting
    int8_t appIndex = appFind(app->id);
    if (appIndex != lastDisplayedAppIndex) {
        displayClear();
        lastDisplayedAppIndex = appIndex;
        // Reset weather display cache to force full redraw
        weatherLastDrawnMinute = -1;
        weatherLastUpdateDrawn = 0;
        // Reset tracker display cache to force full redraw
        trackerLastUpdateDrawn = 0;
        resetTrackerScrollStates();
        // Reset forecast pagination to first page
        forecastPage = 0;
        lastForecastPageSwitch = millis();
    }

    // Handle system apps
    if (strcmp(app->id, "clock") == 0) {
        displayShowTime();
        return;
    }

    if (strcmp(app->id, "date") == 0) {
        displayShowDate();
        return;
    }

    if (strcmp(app->id, "weatherclock") == 0) {
        displayShowWeatherClock(app);
        return;
    }

    // Tracker layout apps (ID starts with "tracker_")
    if (strncmp(app->id, TRACKER_ID_PREFIX, strlen(TRACKER_ID_PREFIX)) == 0) {
        const char* trackerName = app->id + strlen(TRACKER_ID_PREFIX);
        TrackerData* tracker = trackerFind(trackerName);
        if (tracker && tracker->valid) {
            // The same app can have rendered through the custom layout below moments ago, while
            // its tracker data was still missing. That fallback arms appScrollState with the
            // symbol it printed as plain text, and nothing else disarms it: without this the
            // loop would keep asking for 20 redraws a second for a string no longer drawn.
            if (appScrollState.needsScroll) {
                resetScrollState();
            }
            displayShowTracker(tracker, app);
            return;
        }
        // Fallback to default custom app layout if no data
    }

    // Multi-zone layout apps
    if (app->zoneCount >= 2) {
        displayShowMultiZone(app);
        return;
    }

    // Custom apps (single-zone)
    dma_display->clearScreen();

    // Layout calculation - VERTICAL layout for 64x64 panel
    // +----------64px-----------+
    // |      Icon (8-16px)      |  <- centered, top
    // |                         |
    // |         Text            |  <- centered, below icon
    // |      (scrollable)       |
    // +-------------------------+

    int16_t textAreaX = 2;
    int16_t textAreaWidth = DISPLAY_WIDTH - 4;  // 2px margin each side
    int16_t textYPos = 28;  // Default Y position for text

    // Try to load icon if specified
    CachedIcon* icon = nullptr;
    if (strlen(app->icon) > 0) {
        icon = getIcon(app->icon);
    }

