nicolas-codemate/esp32-pixelcast/src/main.cpp
    // Adjust layout if icon is present - VERTICAL layout
    if (icon && icon->valid) {
        // Calculate displayed size (upscale x2 for 8x8 icons)
        uint8_t scale = (icon->width <= 8 && icon->height <= 8) ? 2 : 1;
        uint8_t displayWidth = icon->width * scale;
        uint8_t displayHeight = icon->height * scale;

        // Draw icon centered horizontally at top
        int16_t iconX = (DISPLAY_WIDTH - displayWidth) / 2;
        int16_t iconY = 2;  // 2px from top
        drawIcon(icon, iconX, iconY);

        // Text starts below icon with gap
        textYPos = iconY + displayHeight + 6;  // 6px gap below icon
    }

    dma_display->setTextSize(1);

    // Calculate text width and check if scrolling needed
    scrollStateArm(appScrollState, calculateTextWidth(app->text), textAreaWidth);

    // Calculate x position with scroll offset
    int16_t xPos = textAreaX;
    if (appScrollState.needsScroll) {
        xPos = textAreaX - appScrollState.scrollOffset;
    }

    // Draw text with segment-aware coloring
    printTextWithSegments(app->text, xPos, textYPos, app->textColor,
                          app->textSegments, app->textSegmentCount);

    // Draw label below text if present (TomThumb font, dimmed color)
    if (app->label[0] != '\0') {
        int16_t labelWidth = calculateTomThumbTextWidth(app->label);
        int16_t labelX = (DISPLAY_WIDTH - labelWidth) / 2;
        if (labelX < 2) labelX = 2;
        int16_t labelY = textYPos + 12;
        printLabelWithSegments(app->label, labelX, labelY, app->textColor,
                               app->labelSegments, app->labelSegmentCount, true);
    }

    drawIndicators();

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

// ============================================================================
// Multi-Zone Display Rendering
// ============================================================================

// Render a single zone within its bounding box
void displayShowZone(AppZone* zone, int16_t x, int16_t y, int16_t w, int16_t h) {
    if (!zone) return;

    dma_display->setTextSize(1);

    // Try to load icon
    CachedIcon* icon = nullptr;
    if (strlen(zone->icon) > 0) {
        icon = getIcon(zone->icon);
    }

    bool isFullWidth = (w >= 48);

    bool hasLabel = (zone->label[0] != '\0');

    // Layout constants for label positioning
    // NULL font: setCursor = top of glyph, 7px tall -> occupies textY to textY+6
    // TomThumb: setCursor = baseline, ~5px above -> occupies labelY-4 to labelY
    // Gap of 2px between text bottom and label top: labelY - 4 = textY + 6 + 2 -> labelY = textY + 12

    if (isFullWidth) {
        // Full-width zone (64x31): icon left, text+label right
        int16_t textX = x + 2;

        // With label: spread text (upper) and label (lower) across zone height
        // Without label: center text vertically
        // h=31 -> text at y+4 (top=y+4..y+10), label baseline at y+23 (top=y+19..y+23)
        int16_t textY = hasLabel ? y + 4 : y + (h / 2) - 3;

        if (icon && icon->valid) {
            // Icon at left, vertically centered in zone
            uint8_t scale = (icon->width <= 8 && icon->height <= 8) ? 2 : 1;
            uint8_t displayWidth = icon->width * scale;
            uint8_t displayHeight = icon->height * scale;
            int16_t iconX = x + 2;
            int16_t iconY = y + (h - displayHeight) / 2;
            drawIconAtScale(icon, iconX, iconY, scale);

            // Text starts after icon
            textX = iconX + displayWidth + 3;
        }

        // Truncate text to fit available width
        int16_t availableWidth = (x + w) - textX;
        int16_t maxChars = availableWidth / 6;  // 6px per char (5x7 font + 1px spacing)
        char truncatedText[32];
        strlcpy(truncatedText, zone->text, sizeof(truncatedText));
        if ((int16_t)strlen(truncatedText) > maxChars && maxChars > 0) {
            truncatedText[maxChars] = '\0';
        }

        printTextWithSegments(truncatedText, textX, textY, zone->textColor,
                              zone->textSegments, zone->textSegmentCount);

        // Draw label in lower portion of zone (TomThumb, dimmed)
        if (hasLabel) {
            int16_t labelY = y + h - 6;  // Near bottom of zone
            printLabelWithSegments(zone->label, textX, labelY, zone->textColor,
                                   zone->labelSegments, zone->labelSegmentCount, true);
        }
    } else {
        // Half-width zone (31x31): icon top-left, text beside icon, label at bottom
        bool hasIcon = (icon && icon->valid);

        int16_t textX = x;
        int16_t textY = hasLabel ? y + 3 : y + (h / 2) - 3;

        if (hasIcon) {
            // Icon at top-left, tight margins, native size (no upscale)
            int16_t iconX = x;
            int16_t iconY = y + 2;
            drawIconAtScale(icon, iconX, iconY, 1);

            // Text starts after icon with 1px gap
            textX = iconX + icon->width + 1;
        }

        // Check if text fits in default font (6px/char), fallback to TomThumb (4px/char)
        int16_t availableWidth = (x + w) - textX;
        int16_t textLen = (int16_t)strlen(zone->text);
        bool useCompactText = (textLen * 6 > availableWidth);
        int16_t charWidth = useCompactText ? 4 : 6;

        int16_t maxChars = availableWidth / charWidth;
        char truncatedText[32];
        strlcpy(truncatedText, zone->text, sizeof(truncatedText));
        if (textLen > maxChars && maxChars > 0) {
            truncatedText[maxChars] = '\0';
        }

        if (useCompactText) {
            // TomThumb: baseline positioning, adjust Y (+5px from top for baseline)
            int16_t compactY = hasLabel ? y + 8 : y + (h / 2) + 2;
            printLabelWithSegments(truncatedText, textX, compactY, zone->textColor,
                                   zone->textSegments, zone->textSegmentCount, false);
        } else {
            // Default font
            printTextWithSegments(truncatedText, textX, textY, zone->textColor,
                                  zone->textSegments, zone->textSegmentCount);
        }

