nicolas-codemate/esp32-pixelcast/src/main.cpp
        // Draw label at bottom of zone with good margin
        if (hasLabel) {
            int16_t labelWidth = calculateTomThumbTextWidth(zone->label);
            int16_t labelX = x + (w - labelWidth) / 2;
            if (labelX < x) labelX = x;
            int16_t labelY = y + h - 6;
            printLabelWithSegments(zone->label, labelX, labelY, zone->textColor,
                                   zone->labelSegments, zone->labelSegmentCount, true);
        }
    }
}

// Render multi-zone layout for an app
void displayShowMultiZone(AppItem* app) {
    if (!app || app->zoneCount < 2) return;

    dma_display->clearScreen();

    // Build array of all zones (zone 0 from main app fields, zones 1-3 from zones[])
    AppZone zone0;
    strlcpy(zone0.text, app->text, sizeof(zone0.text));
    strlcpy(zone0.icon, app->icon, sizeof(zone0.icon));
    strlcpy(zone0.label, app->label, sizeof(zone0.label));
    zone0.textColor = app->textColor;
    memcpy(zone0.textSegments, app->textSegments, sizeof(app->textSegments));
    zone0.textSegmentCount = app->textSegmentCount;
    memcpy(zone0.labelSegments, app->labelSegments, sizeof(app->labelSegments));
    zone0.labelSegmentCount = app->labelSegmentCount;

    AppZone* allZones[MAX_ZONES] = { &zone0, nullptr, nullptr, nullptr };
    for (uint8_t i = 1; i < app->zoneCount && i < MAX_ZONES; i++) {
        allZones[i] = &app->zones[i - 1];
    }

    // Separator line color (dark gray)
    uint16_t separatorColor = dma_display->color565(40, 40, 40);

    switch (app->zoneCount) {
        case 2: {
            // Two horizontal rows: zone0 top (64x31), zone1 bottom (64x31)
            // Separator at y=31
            dma_display->drawFastHLine(0, 31, 64, separatorColor);

            displayShowZone(allZones[0], 0, 0, 64, 31);
            displayShowZone(allZones[1], 0, 33, 64, 31);
            break;
        }
        case 3: {
            // Top row full-width (zone0, 64x31), bottom row split (zone1 + zone2, 31x31 each)
            // Horizontal separator at y=31
            dma_display->drawFastHLine(0, 31, 64, separatorColor);
            // Vertical separator in bottom half at x=31
            dma_display->drawFastVLine(31, 33, 31, separatorColor);

            displayShowZone(allZones[0], 0, 0, 64, 31);
            displayShowZone(allZones[1], 0, 33, 31, 31);
            displayShowZone(allZones[2], 33, 33, 31, 31);
            break;
        }
        case 4: {
            // Four quadrants (31x31 each)
            // Horizontal separator at y=31
            dma_display->drawFastHLine(0, 31, 64, separatorColor);
            // Vertical separator at x=31
            dma_display->drawFastVLine(31, 0, 64, separatorColor);

            displayShowZone(allZones[0], 0, 0, 31, 31);
            displayShowZone(allZones[1], 33, 0, 31, 31);
            displayShowZone(allZones[2], 0, 33, 31, 31);
            displayShowZone(allZones[3], 33, 33, 31, 31);
            break;
        }
    }

    drawIndicators();

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

void displayClear() {
    // Every buffer, so a later flip cannot bring back the frame that was on screen
    for (uint8_t remainingBuffers = DISPLAY_BUFFER_COUNT; remainingBuffers > 0; remainingBuffers--) {
        dma_display->clearScreen();
        #if DOUBLE_BUFFER
            dma_display->flipDMABuffer();
        #endif
    }
}

// Repainted whole on every step: with two buffers, a bar drawn on top of the previous frame
// would land on the frame before it.
void displayDrawOtaProgress(uint8_t percent) {
    dma_display->fillScreen(0);
    dma_display->setFont(NULL);
    dma_display->setTextSize(1);
    dma_display->setTextColor(dma_display->color565(255, 165, 0));
    // "OTA" default font, centered (3 chars x 6px = 18px)
    dma_display->setCursor(23, 4);
    dma_display->print("OTA");
    // "UPDATE" same font, centered (6 chars x 6px = 36px)
    dma_display->setCursor(14, 18);
    dma_display->print("UPDATE");
    // Progress bar frame near bottom
    dma_display->drawRect(4, 46, 56, 7, dma_display->color565(80, 80, 80));

    uint8_t barWidth = (uint8_t)(((uint16_t)percent * 54) / 100);
    if (barWidth > 0) {
        dma_display->fillRect(5, 47, barWidth, 5, dma_display->color565(255, 165, 0));
    }

    char percentText[8];
    snprintf(percentText, sizeof(percentText), "%d%%", percent);
    dma_display->setFont(&TomThumb);
    dma_display->setTextColor(dma_display->color565(150, 150, 150));
    int16_t textWidth = calculateTomThumbTextWidth(percentText);
    dma_display->setCursor((DISPLAY_WIDTH - textWidth) / 2, 60);
    dma_display->print(percentText);
    dma_display->setFont(NULL);

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

void displaySetBrightness(uint8_t brightness) {
    currentBrightness = constrain(brightness, MIN_BRIGHTNESS, MAX_BRIGHTNESS);
    dma_display->setBrightness8(currentBrightness);
    Serial.printf("[DISPLAY] Brightness set to %d\n", currentBrightness);
}

// A stale screen shows everything at a quarter brightness. Masking after the shift keeps
// each component's bits from bleeding into the one below it.
uint32_t dimColorQuarter(uint32_t color)
{
    return (color >> 2) & 0x3F3F3F;
}

// The panel has no accented glyphs in either font, so an accented name is drawn as its
// closest ASCII letter. Callers must pass both UTF-8 bytes: 'e' acute is C3 A9 and the
// copyright sign is C2 A9, so the continuation byte alone does not identify the character.
// An unknown C3 sequence becomes '?' and anything else is dropped, which is what the panel
// already did before this was a shared table.
char utf8FrenchToAscii(uint8_t leadByte, uint8_t continuationByte)
{
    if (leadByte != 0xC3)
    {
        return 0;
    }

    switch (continuationByte)
    {
        case 0x80: case 0x81: case 0x82: case 0x83: case 0x84: case 0x85: return 'A';
        case 0x87: return 'C';
        case 0x88: case 0x89: case 0x8A: case 0x8B: return 'E';
        case 0x8C: case 0x8D: case 0x8E: case 0x8F: return 'I';
        case 0x91: return 'N';
        case 0x92: case 0x93: case 0x94: case 0x95: case 0x96: return 'O';
        case 0x99: case 0x9A: case 0x9B: case 0x9C: return 'U';
        case 0xA0: case 0xA1: case 0xA2: case 0xA3: case 0xA4: case 0xA5: return 'a';
        case 0xA7: return 'c';
        case 0xA8: case 0xA9: case 0xAA: case 0xAB: return 'e';
        case 0xAC: case 0xAD: case 0xAE: case 0xAF: return 'i';
        case 0xB1: return 'n';
        case 0xB2: case 0xB3: case 0xB4: case 0xB5: case 0xB6: return 'o';
        case 0xB9: case 0xBA: case 0xBB: case 0xBC: return 'u';
        default: return '?';
    }
}

// Must advance exactly like printTextWithSpecialChars, or a scrolling string is measured
// against a width it never occupies: 6 px per drawn character, 4 px for the degree glyph,
// nothing for bytes the panel drops.
int16_t calculateTextWidth(const char* text) {
    const uint8_t charWidth = 6;
    int16_t totalWidth = 0;

