nicolas-codemate/esp32-pixelcast/src/main.cpp
    const uint8_t* ptr = (const uint8_t*)text;
    while (*ptr) {
        uint8_t c = *ptr;

        if ((c == 0xC2 && *(ptr + 1) == 0xB0) || c == 0xB0) {
            totalWidth += 4;
            ptr += (c == 0xB0) ? 1 : 2;
            continue;
        }

        if (c == 0xC3 && *(ptr + 1)) {
            totalWidth += charWidth;
            ptr += 2;
            continue;
        }

        if (c >= 32 && c <= 126) {
            totalWidth += charWidth;
        }
        ptr++;
    }

    return totalWidth;
}

// TomThumb is not monospaced: '1' advances 3 px and space 2 px where most
// glyphs advance 4, so a strlen-based estimate misplaces right-aligned and
// centred strings and makes them jitter as their digits change.
int16_t calculateTomThumbTextWidth(const char* text)
{
    int16_t totalWidth = 0;
    const uint8_t* character = (const uint8_t*)text;

    while (*character)
    {
        uint8_t characterCode = *character;

        if (characterCode == 0xC3 && *(character + 1))
        {
            characterCode = (uint8_t)utf8FrenchToAscii(characterCode, *(character + 1));
            character++;
        }

        if (characterCode >= 0x20 && characterCode <= 0x7E)
        {
            totalWidth += (int16_t)pgm_read_byte(&TomThumbGlyphs[characterCode - 0x20].xAdvance);
        }
        character++;
    }

    return totalWidth;
}

// One three-phase run for every scrolling text on screen: pause at the start, step one pixel
// per SCROLL_SPEED, pause at the end, rewind. Returns whether the caller has to repaint.
bool scrollStateAdvance(ScrollState& state, unsigned long now) {
    if (!state.needsScroll) return false;

    switch (state.scrollPhase) {
        case 0:  // pause_start
            if (now - state.lastScrollTime >= SCROLL_PAUSE) {
                state.scrollPhase = 1;
                state.lastScrollTime = now;
            }
            return false;

        case 1:  // scrolling
            if (now - state.lastScrollTime < SCROLL_SPEED) return false;
            state.lastScrollTime = now;
            state.scrollOffset++;
            if (state.scrollOffset >= state.textWidth - state.availableWidth + 10) {
                state.scrollPhase = 2;
            }
            return true;

        case 2:  // pause_end
            if (now - state.lastScrollTime >= SCROLL_PAUSE) {
                state.scrollOffset = 0;
                state.scrollPhase = 0;
                state.lastScrollTime = now;
            }
            return false;
    }

    return false;
}

// Feed a state from the text it has to show, and rewind it when the text no longer overflows.
void scrollStateArm(ScrollState& state, int16_t textWidth, int16_t availableWidth) {
    if (state.textWidth == textWidth && state.availableWidth == availableWidth) return;

    state.textWidth = textWidth;
    state.availableWidth = availableWidth;
    state.needsScroll = (textWidth > availableWidth);
    if (!state.needsScroll) {
        state.scrollOffset = 0;
        state.scrollPhase = 0;
    }
}

void scrollStateReset(ScrollState& state) {
    state.scrollOffset = 0;
    state.lastScrollTime = millis();
    state.scrollPhase = 0;  // Start with pause
    state.needsScroll = false;
    state.textWidth = 0;
    state.availableWidth = 0;
}

void resetScrollState() {
    scrollStateReset(appScrollState);
}

void resetNotifScrollState() {
    scrollStateReset(notifScrollState);
}

void resetTrackerScrollStates() {
    scrollStateReset(trackerSymbolScrollState);
    scrollStateReset(trackerBottomScrollState);
}

// ============================================================================
// Notification Display
// ============================================================================

void displayShowNotification(NotificationItem* notif) {
    if (!notif || !notif->active) return;

    // Mark display timestamp on first render
    if (notif->displayedAt == 0) {
        notif->displayedAt = millis();
    }

    // Layout: horizontal separators with background color margins
    // [bg margin 4px] [separator line] [content: icon + text] [separator line] [bg margin 4px]
    const int16_t marginHeight = 6;
    const int16_t separatorTopY = marginHeight;                            // y=4
    const int16_t separatorBottomY = DISPLAY_HEIGHT - marginHeight - 1;    // y=59
    const int16_t contentY = separatorTopY + 2;                            // y=6
    const int16_t contentH = separatorBottomY - contentY - 1;             // 52
    const int16_t textPadding = 2;                                         // Horizontal text padding
    const int16_t textAreaWidth = DISPLAY_WIDTH - textPadding * 2;         // 60

    // Colors
    uint8_t tr = (notif->textColor >> 16) & 0xFF;
    uint8_t tg = (notif->textColor >> 8) & 0xFF;
    uint8_t tb = notif->textColor & 0xFF;
    uint16_t lineColor = dma_display->color565(tr, tg, tb);
    uint16_t black = dma_display->color565(0, 0, 0);

    uint16_t bgFill = black;
    if (notif->backgroundColor != 0) {
        uint8_t br = (notif->backgroundColor >> 16) & 0xFF;
        uint8_t bg = (notif->backgroundColor >> 8) & 0xFF;
        uint8_t bb = notif->backgroundColor & 0xFF;
        bgFill = dma_display->color565(br, bg, bb);
    }

    // === Build frame (no clearScreen to avoid DMA flicker) ===

    // 1. Background color margins (top and bottom strips)
    dma_display->fillRect(0, 0, DISPLAY_WIDTH, marginHeight, bgFill);
    dma_display->fillRect(0, DISPLAY_HEIGHT - marginHeight, DISPLAY_WIDTH, marginHeight, bgFill);

    // 2. Content area (black)
    dma_display->fillRect(0, marginHeight, DISPLAY_WIDTH, DISPLAY_HEIGHT - marginHeight * 2, black);

    // 3. Separator lines
    uint16_t separatorColor = (bgFill != black) ? bgFill : lineColor;
    dma_display->drawFastHLine(0, separatorTopY, DISPLAY_WIDTH, separatorColor);
    dma_display->drawFastHLine(0, separatorBottomY, DISPLAY_WIDTH, separatorColor);

    // 4. Load icon
    CachedIcon* icon = nullptr;
    uint8_t iconDisplayW = 0;
    uint8_t iconDisplayH = 0;
    if (strlen(notif->icon) > 0) {
        icon = getIcon(notif->icon);
        if (icon && icon->valid) {
            uint8_t scale = (icon->width <= 8 && icon->height <= 8) ? 2 : 1;
            iconDisplayW = icon->width * scale;
            iconDisplayH = icon->height * scale;
        } else {
            icon = nullptr;
        }
    }

    // 5. Vertical centering of content (icon + text)
    const int16_t textHeight = 7;
    const int16_t iconTextGap = 4;
    int16_t totalContentH = textHeight;
    if (icon) {
        totalContentH = iconDisplayH + iconTextGap + textHeight;
    }
    int16_t contentStartY = contentY + (contentH - totalContentH) / 2;

    // 6. Draw icon centered horizontally
    int16_t textYPos;
    if (icon) {
        int16_t iconX = (DISPLAY_WIDTH - iconDisplayW) / 2;
        drawIcon(icon, iconX, contentStartY);
        textYPos = contentStartY + iconDisplayH + iconTextGap;
    } else {
        textYPos = contentStartY;
    }

    // 7. Draw text (full width, scrolls off-screen naturally - no clipping needed)
    dma_display->setTextColor(lineColor);
    dma_display->setTextSize(1);

    int16_t textWidth = calculateTextWidth(notif->text);
    scrollStateArm(notifScrollState, textWidth, textAreaWidth);

    int16_t xPos;
    if (!notifScrollState.needsScroll) {
        xPos = textPadding + (textAreaWidth - textWidth) / 2;
    } else {
        xPos = textPadding - notifScrollState.scrollOffset;
    }

    printTextWithSpecialChars(notif->text, xPos, textYPos);

