nicolas-codemate/esp32-pixelcast/src/main.cpp
    Serial.printf("[API] Indicator %d set: mode=%s color=0x%06X\n",
                  index + 1, modeStr[0] ? modeStr : "solid", color);

    char colorHex[8];
    formatColorHex(color, colorHex, sizeof(colorHex));
    char response[128];
    snprintf(response, sizeof(response),
             "{\"success\":true,\"indicator\":%d,\"mode\":\"%s\",\"color\":\"%s\"}",
             index + 1,
             mode == INDICATOR_SOLID ? "solid" : (mode == INDICATOR_BLINK ? "blink" : "fade"),
             colorHex);
    request->send(200, "application/json", response);
}

// Print text with special character handling
// Replaces non-ASCII characters with ASCII equivalents or draws them manually
void printTextWithSpecialChars(const char* text, int16_t x, int16_t y) {
    int16_t cursorX = x;
    const uint8_t charWidth = 6;  // 5x7 font + 1px spacing

    dma_display->setCursor(cursorX, y);

    const uint8_t* ptr = (const uint8_t*)text;
    while (*ptr) {
        uint8_t c = *ptr;

        // Handle UTF-8 degree symbol (C2 B0)
        if (c == 0xC2 && *(ptr + 1) == 0xB0) {
            // Draw degree symbol as small circle (3x3 at top)
            // Use white color - will inherit from setTextColor context
            int16_t dx = cursorX;
            int16_t dy = y - 6;  // Position at top of character
            dma_display->drawPixel(dx + 1, dy, 0xFFFF);
            dma_display->drawPixel(dx, dy + 1, 0xFFFF);
            dma_display->drawPixel(dx + 2, dy + 1, 0xFFFF);
            dma_display->drawPixel(dx + 1, dy + 2, 0xFFFF);
            cursorX += 4;  // Smaller width for degree
            ptr += 2;  // Skip both UTF-8 bytes
            dma_display->setCursor(cursorX, y);
            continue;
        }

        // Handle Latin-1 degree symbol (direct byte 0xB0)
        if (c == 0xB0) {
            int16_t dx = cursorX;
            int16_t dy = y - 6;
            dma_display->drawPixel(dx + 1, dy, 0xFFFF);
            dma_display->drawPixel(dx, dy + 1, 0xFFFF);
            dma_display->drawPixel(dx + 2, dy + 1, 0xFFFF);
            dma_display->drawPixel(dx + 1, dy + 2, 0xFFFF);
            cursorX += 4;
            ptr++;
            dma_display->setCursor(cursorX, y);
            continue;
        }

        // Handle UTF-8 accented characters (common French)
        if (c == 0xC3 && *(ptr + 1)) {
            dma_display->print(utf8FrenchToAscii(c, *(ptr + 1)));
            cursorX += charWidth;
            ptr += 2;
            dma_display->setCursor(cursorX, y);
            continue;
        }

        // Standard ASCII character
        if (c >= 32 && c <= 126) {
            dma_display->print((char)c);
            cursorX += charWidth;
        }
        // Skip other non-printable characters

        ptr++;
        dma_display->setCursor(cursorX, y);
    }
}

// Draw text with per-segment coloring (NULL font, 6px/char)
// segmentCount==0: uses defaultColor and delegates to printTextWithSpecialChars
// segmentCount>0: switches color at segment boundaries
void printTextWithSegments(const char* text, int16_t x, int16_t y,
                           uint32_t defaultColor, const TextSegment* segments, uint8_t segmentCount) {
    if (segmentCount == 0) {
        uint8_t r = (defaultColor >> 16) & 0xFF;
        uint8_t g = (defaultColor >> 8) & 0xFF;
        uint8_t b = defaultColor & 0xFF;
        dma_display->setTextColor(dma_display->color565(r, g, b));
        printTextWithSpecialChars(text, x, y);
        return;
    }

    const uint8_t charWidth = 6;
    int16_t cursorX = x;
    dma_display->setCursor(cursorX, y);

    // Start with first segment color or default
    uint8_t currentSegment = 0;
    uint32_t currentColor = (segmentCount > 0) ? segments[0].color : defaultColor;
    uint8_t r = (currentColor >> 16) & 0xFF;
    uint8_t g = (currentColor >> 8) & 0xFF;
    uint8_t b = currentColor & 0xFF;
    uint16_t color565 = dma_display->color565(r, g, b);
    dma_display->setTextColor(color565);

    uint8_t charIndex = 0;  // Visual char index (UTF-8 multi-byte = 1 visual char)
    const uint8_t* ptr = (const uint8_t*)text;

    while (*ptr) {
        // Check if we need to switch to next segment color
        if (currentSegment + 1 < segmentCount && charIndex >= segments[currentSegment + 1].offset) {
            currentSegment++;
            currentColor = segments[currentSegment].color;
            r = (currentColor >> 16) & 0xFF;
            g = (currentColor >> 8) & 0xFF;
            b = currentColor & 0xFF;
            color565 = dma_display->color565(r, g, b);
            dma_display->setTextColor(color565);
        }

        uint8_t c = *ptr;

        // Handle UTF-8 degree symbol (C2 B0)
        if (c == 0xC2 && *(ptr + 1) == 0xB0) {
            int16_t dx = cursorX;
            int16_t dy = y - 6;
            dma_display->drawPixel(dx + 1, dy, color565);
            dma_display->drawPixel(dx, dy + 1, color565);
            dma_display->drawPixel(dx + 2, dy + 1, color565);
            dma_display->drawPixel(dx + 1, dy + 2, color565);
            cursorX += 4;
            ptr += 2;
            charIndex++;
            dma_display->setCursor(cursorX, y);
            continue;
        }

        // Handle Latin-1 degree symbol (direct byte 0xB0)
        if (c == 0xB0) {
            int16_t dx = cursorX;
            int16_t dy = y - 6;
            dma_display->drawPixel(dx + 1, dy, color565);
            dma_display->drawPixel(dx, dy + 1, color565);
            dma_display->drawPixel(dx + 2, dy + 1, color565);
            dma_display->drawPixel(dx + 1, dy + 2, color565);
            cursorX += 4;
            ptr++;
            charIndex++;
            dma_display->setCursor(cursorX, y);
            continue;
        }

        // Handle UTF-8 accented characters (common French)
        if (c == 0xC3 && *(ptr + 1)) {
            dma_display->print(utf8FrenchToAscii(c, *(ptr + 1)));
            cursorX += charWidth;
            ptr += 2;
            charIndex++;
            dma_display->setCursor(cursorX, y);
            continue;
        }

