nicolas-codemate/esp32-pixelcast/src/main.cpp
        // Standard ASCII character
        if (c >= 32 && c <= 126) {
            dma_display->print((char)c);
            cursorX += charWidth;
            charIndex++;
        }

        ptr++;
        dma_display->setCursor(cursorX, y);
    }
}

// Adafruit_GFX draws a character whole or not at all, so one that straddles a bound goes
// through a stencil first.
void drawCharacterWithinBounds(char character, int16_t x, int16_t y,
                               int16_t boundLeft, int16_t boundRight, uint16_t color) {
    static GFXcanvas1 glyphStencil(TEXT_CELL_WIDTH, TEXT_CELL_HEIGHT);

    // Opaque draw, so every cell is written and nothing carries over from the last character
    glyphStencil.drawChar(0, 0, character, 1, 0, 1);

    for (int16_t column = 0; column < TEXT_CELL_WIDTH; column++) {
        int16_t panelX = x + column;
        if (panelX < boundLeft || panelX >= boundRight) continue;

        for (int16_t row = 0; row < TEXT_CELL_HEIGHT; row++) {
            if (glyphStencil.getPixel(column, row)) {
                dma_display->drawPixel(panelX, y + row, color);
            }
        }
    }
}

// Draws text the way printTextWithSpecialChars does, confined to [boundLeft, boundRight).
// The panel has no clip rectangle, and the alternative - painting the row whole and wiping
// what overflows - leaves those pixels lit for as long as the rest of the row takes to draw,
// which the DMA scans out as an artefact over whatever the row slides behind.
void printTextWithinBounds(const char* text, int16_t x, int16_t y,
                           int16_t boundLeft, int16_t boundRight, uint32_t color) {
    uint16_t color565 = dma_display->color565((color >> 16) & 0xFF,
                                              (color >> 8) & 0xFF,
                                              color & 0xFF);
    dma_display->setTextColor(color565);

    int16_t cursorX = x;
    const uint8_t* ptr = (const uint8_t*)text;

    // Advances exactly like printTextWithSpecialChars, so a scrolling string is drawn against
    // the width calculateTextWidth measured for it
    while (*ptr && cursorX < boundRight) {
        if ((*ptr == 0xC2 && *(ptr + 1) == 0xB0) || *ptr == 0xB0) {
            static const int8_t degreePixels[4][2] = {{1, 0}, {0, 1}, {2, 1}, {1, 2}};
            for (uint8_t i = 0; i < 4; i++) {
                int16_t pixelX = cursorX + degreePixels[i][0];
                if (pixelX >= boundLeft && pixelX < boundRight) {
                    dma_display->drawPixel(pixelX, y - 6 + degreePixels[i][1], color565);
                }
            }
            ptr += (*ptr == 0xB0) ? 1 : 2;
            cursorX += 4;
            continue;
        }

        char character;
        if (*ptr == 0xC3 && *(ptr + 1)) {
            character = utf8FrenchToAscii(*ptr, *(ptr + 1));
            ptr += 2;
        } else if (*ptr >= 32 && *ptr <= 126) {
            character = (char)*ptr;
            ptr++;
        } else {
            ptr++;  // Dropped, and measured as dropped
            continue;
        }

        if (cursorX >= boundLeft && cursorX + TEXT_CELL_WIDTH <= boundRight) {
            dma_display->setCursor(cursorX, y);
            dma_display->print(character);
        } else if (cursorX + TEXT_CELL_WIDTH > boundLeft) {
            drawCharacterWithinBounds(character, cursorX, y, boundLeft, boundRight, color565);
        }

        cursorX += TEXT_CELL_WIDTH;
    }
}

// Draw label text with per-segment coloring (TomThumb font, baseline positioning)
// dimDefault=true + segmentCount==0: dims defaultColor 50% (standard label behavior)
// dimDefault=false: uses defaultColor as-is (compact text in half-width zones)
// segmentCount>0: uses segment colors at full brightness
void printLabelWithSegments(const char* text, int16_t x, int16_t y,
                            uint32_t defaultColor, const TextSegment* segments, uint8_t segmentCount,
                            bool dimDefault) {
    dma_display->setFont(&TomThumb);
    dma_display->setCursor(x, y);

    uint32_t currentColor = (segmentCount > 0) ? segments[0].color : defaultColor;
    uint8_t r = (currentColor >> 16) & 0xFF;
    uint8_t g = (currentColor >> 8) & 0xFF;
    uint8_t b = currentColor & 0xFF;
    if (segmentCount == 0 && dimDefault) {
        r = r * 3 / 4;
        g = g * 3 / 4;
        b = b * 3 / 4;
    }
    dma_display->setTextColor(dma_display->color565(r, g, b));

    // Segment offsets are byte positions, as parseTextFieldWithSegments records them
    uint8_t byteIndex = 0;
    uint8_t currentSegment = 0;
    const uint8_t* ptr = (const uint8_t*)text;

    while (*ptr) {
        if (currentSegment + 1 < segmentCount && byteIndex >= segments[currentSegment + 1].offset) {
            currentSegment++;
            currentColor = segments[currentSegment].color;
            r = (currentColor >> 16) & 0xFF;
            g = (currentColor >> 8) & 0xFF;
            b = currentColor & 0xFF;
            dma_display->setTextColor(dma_display->color565(r, g, b));
        }

        uint8_t c = *ptr;

        // TomThumb covers printable ASCII only, so an accented name arrives transliterated
        if (c == 0xC3 && *(ptr + 1)) {
            dma_display->print(utf8FrenchToAscii(c, *(ptr + 1)));
            byteIndex += 2;
            ptr += 2;
            continue;
        }

        if (c >= 0x20 && c <= 0x7E) {
            dma_display->print((char)c);
        }
        byteIndex++;
        ptr++;
    }

    dma_display->setFont(NULL);
}

// ============================================================================
// Icon Functions
// ============================================================================

void initIconCache() {
    for (uint8_t i = 0; i < MAX_ICON_CACHE; i++) {
        iconCache[i].name[0] = '\0';
        iconCache[i].pixels = nullptr;
        iconCache[i].width = 0;
        iconCache[i].height = 0;
        iconCache[i].valid = false;
        iconCache[i].lastUsed = 0;
    }
    Serial.println("[ICON] Cache initialized");
}

int pngDrawCallback(PNGDRAW *pDraw) {
    if (!pngDecodeTarget || pDraw->y >= 16) return 1;

