nicolas-codemate/esp32-pixelcast/src/main.cpp
    // Auto-download LaMetric icons on demand
    if (strncmp(name, "lm_", 3) == 0) {
        const char* idStr = name + 3;
        // Validate that the rest is numeric
        bool isNumeric = (*idStr != '\0');
        for (const char* p = idStr; *p; p++) {
            if (*p < '0' || *p > '9') { isNumeric = false; break; }
        }
        if (isNumeric && !isFailedIconDownload(name)) {
            uint32_t iconId = strtoul(idStr, nullptr, 10);
            Serial.printf("[ICON] Auto-downloading LaMetric icon: %s (id=%u)\n", name, iconId);
            if (downloadLaMetricIcon(iconId, name)) {
                return loadIcon(name);
            } else {
                addFailedIconDownload(name);
                Serial.printf("[ICON] Download failed, blacklisted for %ds: %s\n",
                              FAILED_ICON_RETRY_DELAY / 1000, name);
            }
        }
    }

    return nullptr;
}

void drawIcon(CachedIcon* icon, int16_t x, int16_t y) {
    if (!icon || !icon->valid || !icon->pixels) return;

    // Upscale x2 for small icons (8x8 -> 16x16)
    uint8_t scale = (icon->width <= 8 && icon->height <= 8) ? 2 : 1;

    for (uint8_t py = 0; py < icon->height; py++) {
        for (uint8_t px = 0; px < icon->width; px++) {
            uint16_t pixel = icon->pixels[py * icon->width + px];
            if (pixel != 0) {  // Skip transparent/black pixels
                if (scale == 2) {
                    // Draw 2x2 block for each pixel
                    int16_t dx = x + px * 2;
                    int16_t dy = y + py * 2;
                    dma_display->drawPixel(dx, dy, pixel);
                    dma_display->drawPixel(dx + 1, dy, pixel);
                    dma_display->drawPixel(dx, dy + 1, pixel);
                    dma_display->drawPixel(dx + 1, dy + 1, pixel);
                } else {
                    dma_display->drawPixel(x + px, y + py, pixel);
                }
            }
        }
    }
}

void invalidateCachedIcon(const char* name) {
    if (!name || strlen(name) == 0) return;

    for (uint8_t i = 0; i < MAX_ICON_CACHE; i++) {
        if (iconCache[i].valid && strcmp(iconCache[i].name, name) == 0) {
            if (iconCache[i].pixels) {
                free(iconCache[i].pixels);
                iconCache[i].pixels = nullptr;
            }
            iconCache[i].valid = false;
            iconCache[i].name[0] = '\0';
            Serial.printf("[ICON] Invalidated cached icon: %s\n", name);
            return;
        }
    }
}

bool validatePngHeader(const uint8_t* data, size_t len) {
    if (len < 8) return false;
    // PNG magic bytes: 89 50 4E 47 0D 0A 1A 0A
    return (data[0] == 0x89 && data[1] == 0x50 && data[2] == 0x4E && data[3] == 0x47 &&
            data[4] == 0x0D && data[5] == 0x0A && data[6] == 0x1A && data[7] == 0x0A);
}

bool validateGifHeader(const uint8_t* data, size_t len) {
    if (len < 6) return false;
    // GIF magic: "GIF87a" or "GIF89a"
    return (data[0] == 'G' && data[1] == 'I' && data[2] == 'F' &&
            data[3] == '8' && (data[4] == '7' || data[4] == '9') && data[5] == 'a');
}

bool downloadLaMetricIcon(uint32_t iconId, const char* saveName) {
    if (!filesystemReady) {
        Serial.println("[LAMETRIC] Filesystem not ready");
        return false;
    }

    WiFiClientSecure client;
    client.setInsecure();  // Skip certificate verification for simplicity

    HTTPClient https;
    bool isPng = true;

    // Try PNG first
    String url = "https://" LAMETRIC_API_HOST LAMETRIC_ICON_PATH + String(iconId) + ".png";
    Serial.printf("[LAMETRIC] Trying PNG: %s\n", url.c_str());

    if (!https.begin(client, url)) {
        Serial.println("[LAMETRIC] HTTPS begin failed");
        return false;
    }

    int httpCode = https.GET();

    // If PNG not found, try GIF
    if (httpCode != HTTP_CODE_OK) {
        https.end();
        url = "https://" LAMETRIC_API_HOST LAMETRIC_ICON_PATH + String(iconId) + ".gif";
        Serial.printf("[LAMETRIC] Trying GIF: %s\n", url.c_str());

        if (!https.begin(client, url)) {
            Serial.println("[LAMETRIC] HTTPS begin failed");
            return false;
        }

        httpCode = https.GET();
        isPng = false;
    }

    if (httpCode != HTTP_CODE_OK) {
        Serial.printf("[LAMETRIC] HTTP error: %d\n", httpCode);
        https.end();
        return false;
    }

    // Check file size
    int contentLength = https.getSize();
    if (contentLength > MAX_ICON_SIZE) {
        Serial.printf("[LAMETRIC] Icon too large: %d bytes\n", contentLength);
        https.end();
        return false;
    }

    // Save file with appropriate extension
    String ext = isPng ? ".png" : ".gif";
    String path = String(FS_ICONS_PATH) + "/" + saveName + ext;

    File file = LittleFS.open(path, "w");
    if (!file) {
        Serial.printf("[LAMETRIC] Failed to create file: %s\n", path.c_str());
        https.end();
        return false;
    }

    // Stream response to file
    WiFiClient* stream = https.getStreamPtr();
    uint8_t buffer[256];
    size_t totalWritten = 0;

    while (https.connected() && (contentLength > 0 || contentLength == -1)) {
        size_t available = stream->available();
        if (available) {
            size_t toRead = min(available, sizeof(buffer));
            size_t bytesRead = stream->readBytes(buffer, toRead);
            file.write(buffer, bytesRead);
            totalWritten += bytesRead;
            if (contentLength > 0) {
                contentLength -= bytesRead;
            }
        } else {
            delay(1);
        }
    }

    file.close();
    https.end();

    Serial.printf("[LAMETRIC] Downloaded icon %d as %s (%d bytes)\n", iconId, path.c_str(), totalWritten);

    // Invalidate cache if icon with same name was cached
    invalidateCachedIcon(saveName);

    return true;
}

void handleApiIconsList(AsyncWebServerRequest *request) {
    JsonDocument doc;
    JsonArray icons = doc["icons"].to<JsonArray>();

    File root = LittleFS.open(FS_ICONS_PATH);
    if (root && root.isDirectory()) {
        File file = root.openNextFile();
        while (file) {
            if (!file.isDirectory()) {
                JsonObject obj = icons.add<JsonObject>();
                String filename = String(file.name());
                // Remove path prefix if present
                int lastSlash = filename.lastIndexOf('/');
                if (lastSlash >= 0) {
                    filename = filename.substring(lastSlash + 1);
                }
                // Remove extension for the name
                int lastDot = filename.lastIndexOf('.');
                String name = lastDot > 0 ? filename.substring(0, lastDot) : filename;
                obj["name"] = name;
                obj["filename"] = filename;
                obj["size"] = file.size();
            }
            file = root.openNextFile();
        }
        root.close();
    }

    doc["count"] = icons.size();
    doc["storage"]["used"] = LittleFS.usedBytes();
    doc["storage"]["total"] = LittleFS.totalBytes();

    String response;
    serializeJson(doc, response);
    request->send(200, "application/json", response);
}

