nicolas-codemate/esp32-pixelcast/src/main.cpp
            uint16_t duration = doc["duration"] | settings.defaultDuration;

            // Former name of staleAfter, still accepted
            uint32_t staleAfterSeconds = doc["lifetime"] | 0;
            if (!doc["staleAfter"].isNull()) {
                staleAfterSeconds = doc["staleAfter"].as<uint32_t>();
            }

            StaleBehavior staleBehavior = STALE_HIDE;
            if (!doc["staleBehavior"].isNull() &&
                !parseStaleBehavior(doc["staleBehavior"], &staleBehavior)) {
                request->send(400, "application/json",
                    "{\"error\":\"staleBehavior must be hide, dim, badge or none\"}");
                return;
            }
            if (staleBehavior == STALE_DIM || staleBehavior == STALE_BADGE) {
                request->send(400, "application/json",
                    "{\"error\":\"staleBehavior dim and badge are only supported on tracker apps\"}");
                return;
            }

            int8_t result = appAdd(name.c_str(), parsedText, icon, textColor, duration,
                                   staleAfterSecondsToMillis(staleAfterSeconds), false);

            if (result >= 0) {
                apps[result].staleBehavior = staleBehavior;
                if (!isMultiZone) {
                    // Copy text segments
                    memcpy(apps[result].textSegments, textSegs, sizeof(textSegs));
                    apps[result].textSegmentCount = textSegCount;
                    // Parse label field
                    parseTextFieldWithSegments(doc["label"], apps[result].label,
                                               sizeof(apps[result].label),
                                               apps[result].labelSegments,
                                               &apps[result].labelSegmentCount, textColor);
                }
                // Apply multi-zone data if present
                if (isMultiZone) {
                    appSetZones(result, zonesArray);
                }
                Serial.printf("[API] Custom app '%s' created/updated\n", name.c_str());
                request->send(200, "application/json", "{\"success\":true}");
            } else {
                request->send(500, "application/json", "{\"error\":\"Failed to add app\"}");
            }
        });
    webServer.addHandler(customHandler);

    // DELETE /api/custom - Delete custom app
    webServer.on("/api/custom", HTTP_DELETE, [](AsyncWebServerRequest *request) {
        if (!request->hasParam("name")) {
            request->send(400, "application/json", "{\"error\":\"Missing app name\"}");
            return;
        }

        String name = request->getParam("name")->value();
        if (appRemove(name.c_str())) {
            request->send(200, "application/json", "{\"success\":true}");
        } else {
            request->send(404, "application/json", "{\"error\":\"App not found or is system app\"}");
        }
    });

    // POST /api/settings - Update settings (using AsyncCallbackJsonWebHandler)
    AsyncCallbackJsonWebHandler* settingsHandler = new AsyncCallbackJsonWebHandler("/api/settings",
        [](AsyncWebServerRequest *request, JsonVariant &json) {
            Serial.println("[API] /settings handler called");
            JsonObject doc = json.as<JsonObject>();

            if (doc.isNull()) {
                request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
                return;
            }

            // Everything is validated before anything is applied: a payload that
            // gets a 400 must leave the panel and the stored settings untouched
            JsonObject ntpUpdate;
            if (doc["ntp"].is<JsonObject>()) {
                ntpUpdate = doc["ntp"].as<JsonObject>();
            }

            bool hasWeatherDuration = !doc["weatherDuration"].isNull();
            uint32_t requestedWeatherDuration = 0;
            if (hasWeatherDuration) {
                requestedWeatherDuration = doc["weatherDuration"].as<uint32_t>();
                if (requestedWeatherDuration < (uint32_t)MIN_WEATHER_DURATION ||
                    requestedWeatherDuration > (uint32_t)MAX_WEATHER_DURATION) {
                    char errorMessage[96];
                    snprintf(errorMessage, sizeof(errorMessage),
                             "{\"error\":\"weatherDuration must be between %d and %d ms\"}",
                             MIN_WEATHER_DURATION, MAX_WEATHER_DURATION);
                    request->send(400, "application/json", errorMessage);
                    return;
                }
            }

            const char* requestedTzPosix = nullptr;
            if (!ntpUpdate.isNull() && ntpUpdate["tz_posix"].is<const char*>()) {
                requestedTzPosix = ntpUpdate["tz_posix"].as<const char*>();
                size_t tzLen = strlen(requestedTzPosix);
                if (tzLen == 0 || tzLen >= sizeof(settings.tzPosix)) {
                    request->send(400, "application/json", "{\"error\":\"tz_posix length invalid\"}");
                    return;
                }
            }

            if (!doc["brightness"].isNull()) {
                settings.brightness = doc["brightness"].as<uint8_t>();
                displaySetBrightness(settings.brightness);
            }
            if (!doc["autoRotate"].isNull()) {
                settings.autoRotate = doc["autoRotate"].as<bool>();
                appRotationEnabled = settings.autoRotate;
            }
            if (!doc["defaultDuration"].isNull()) {
                settings.defaultDuration = doc["defaultDuration"].as<uint16_t>();
            }
            if (hasWeatherDuration) {
                settings.weatherDuration = (uint16_t)requestedWeatherDuration;
                weatherClockApplyDuration(settings.weatherDuration);
            }

            bool ntpChanged = false;
            if (!ntpUpdate.isNull()) {
                if (!ntpUpdate["offset"].isNull() || !ntpUpdate["daylight_offset"].isNull()) {
                    Serial.println("[NTP] Legacy ntp.offset/daylight_offset ignored, use ntp.tz_posix");
                }
                if (requestedTzPosix) {
                    strlcpy(settings.tzPosix, requestedTzPosix, sizeof(settings.tzPosix));
                    Serial.printf("[NTP] tz_posix updated to %s\n", settings.tzPosix);
                    ntpChanged = true;
                }
                if (ntpUpdate["server"].is<const char*>()) {
                    strlcpy(settings.ntpServer, ntpUpdate["server"].as<const char*>(), sizeof(settings.ntpServer));
                    Serial.printf("[NTP] server updated to %s\n", settings.ntpServer);
                    ntpChanged = true;
                }
            }
            if (ntpChanged) {
                configTzTime(settings.tzPosix, settings.ntpServer);
            }

            saveSettings();
            Serial.println("[API] Settings updated");
            request->send(200, "application/json", "{\"success\":true}");
        });
    webServer.addHandler(settingsHandler);

    // GET /api/weather - Return current weather data
    webServer.on("/api/weather", HTTP_GET, [](AsyncWebServerRequest *request) {
        JsonDocument doc;

        doc["valid"] = weatherData.valid;

        if (weatherData.valid) {
            unsigned long ageMs = millis() - weatherData.lastUpdate;
            int8_t weatherClockIndex = appFind("weatherclock");
            const AppItem* weatherApp = weatherClockIndex >= 0 ? &apps[weatherClockIndex] : nullptr;
            doc["age"] = ageMs / 1000;
            doc["stale"] = appIsStale(weatherApp);
            if (weatherApp) {
                doc["staleAfter"] = weatherApp->staleAfter / 1000;
                doc["staleBehavior"] = staleBehaviorName(weatherApp->staleBehavior);
            }

            JsonObject current = doc["current"].to<JsonObject>();
            current["icon"] = weatherData.currentIcon;
            current["temp"] = weatherData.currentTemp;
            current["temp_min"] = weatherData.currentTempMin;
            current["temp_max"] = weatherData.currentTempMax;
            current["humidity"] = weatherData.currentHumidity;

