nicolas-codemate/esp32-pixelcast/src/main.cpp
            JsonArray forecastArr = doc["forecast"].to<JsonArray>();
            for (int i = 0; i < weatherData.forecastCount; i++) {
                JsonObject fc = forecastArr.add<JsonObject>();
                fc["day"] = weatherData.forecast[i].dayName;
                fc["icon"] = weatherData.forecast[i].icon;
                fc["temp_min"] = weatherData.forecast[i].tempMin;
                fc["temp_max"] = weatherData.forecast[i].tempMax;
            }

            if (weatherData.today.hourCount > 0) {
                JsonObject today = doc["today"].to<JsonObject>();

                JsonArray hoursArr = today["hours"].to<JsonArray>();
                for (uint8_t i = 0; i < weatherData.today.hourCount; i++) {
                    JsonObject hourObj = hoursArr.add<JsonObject>();
                    hourObj["h"] = weatherData.today.hours[i].hour;
                    hourObj["temp"] = weatherData.today.hours[i].temp;
                    hourObj["pop"] = weatherData.today.hours[i].precipProbability;
                    hourObj["precip"] = weatherData.today.hours[i].precipTenthsOfMm;
                }

                JsonArray segmentsArr = today["segments"].to<JsonArray>();
                for (uint8_t i = 0; i < weatherData.today.segmentCount; i++) {
                    JsonObject segmentObj = segmentsArr.add<JsonObject>();
                    segmentObj["from"] = weatherData.today.segments[i].fromHour;
                    segmentObj["to"] = weatherData.today.segments[i].toHour;
                    segmentObj["icon"] = weatherData.today.segments[i].icon;
                }
            }
        }

        String output;
        serializeJson(doc, output);
        request->send(200, "application/json", output);
    });

    // POST /api/weather - Update weather data
    AsyncCallbackJsonWebHandler* weatherHandler = new AsyncCallbackJsonWebHandler("/api/weather",
        [](AsyncWebServerRequest *request, JsonVariant &json) {
            Serial.println("[API] /weather handler called");
            JsonObject doc = json.as<JsonObject>();

            if (doc.isNull()) {
                request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
                return;
            }

            // Parse current weather
            if (doc["current"].is<JsonObject>()) {
                JsonObject current = doc["current"];
                strlcpy(weatherData.currentIcon, current["icon"] | "", sizeof(weatherData.currentIcon));
                weatherData.currentTemp = current["temp"] | 0;
                weatherData.currentTempMin = current["temp_min"] | 0;
                weatherData.currentTempMax = current["temp_max"] | 0;
                weatherData.currentHumidity = current["humidity"] | 0;
            } else {
                request->send(400, "application/json", "{\"error\":\"Missing 'current' object\"}");
                return;
            }

            // Parse forecast (optional, up to MAX_FORECAST_DAYS days)
            if (doc["forecast"].is<JsonArray>()) {
                JsonArray forecastArr = doc["forecast"];
                int forecastSize = min((int)forecastArr.size(), (int)MAX_FORECAST_DAYS);
                for (int i = 0; i < forecastSize; i++) {
                    JsonObject fc = forecastArr[i];
                    strlcpy(weatherData.forecast[i].icon, fc["icon"] | "", sizeof(weatherData.forecast[i].icon));
                    weatherData.forecast[i].tempMin = fc["temp_min"] | 0;
                    weatherData.forecast[i].tempMax = fc["temp_max"] | 0;
                    strlcpy(weatherData.forecast[i].dayName, fc["day"] | "", sizeof(weatherData.forecast[i].dayName));
                }
                weatherData.forecastCount = forecastSize;
            } else {
                weatherData.forecastCount = 0;
            }

            weatherParseTodayBlock(doc["today"].as<JsonObjectConst>());

            uint32_t staleAfter = WEATHER_DEFAULT_STALE_AFTER;
            if (!doc["staleAfter"].isNull()) {
                staleAfter = staleAfterSecondsToMillis(doc["staleAfter"].as<uint32_t>());
            }

            StaleBehavior staleBehavior = STALE_HIDE;
            if (!doc["staleBehavior"].isNull() &&
                !parseStaleBehavior(doc["staleBehavior"], &staleBehavior)) {
                request->send(400, "application/json",
                    "{\"error\":\"staleBehavior must be hide or none\"}");
                return;
            }
            if (staleBehavior == STALE_DIM || staleBehavior == STALE_BADGE) {
                request->send(400, "application/json",
                    "{\"error\":\"staleBehavior dim and badge are only supported on tracker apps\"}");
                return;
            }
            weatherClockApplyStalePolicy(staleAfter, staleBehavior);

            // Reset forecast pagination on new data
            forecastPage = 0;
            lastForecastPageSwitch = millis();

            weatherData.lastUpdate = millis();
            weatherData.valid = true;

            Serial.printf("[WEATHER] Updated: %d C, %d%% humidity\n",
                         weatherData.currentTemp, weatherData.currentHumidity);
            request->send(200, "application/json", "{\"success\":true}");
        });
    webServer.addHandler(weatherHandler);

    // ========================================================================
    // Tracker API
    // ========================================================================

    // GET /api/trackers - List all active trackers
    webServer.on("/api/trackers", HTTP_GET, [](AsyncWebServerRequest *request) {
        JsonDocument doc;
        JsonArray arr = doc["trackers"].to<JsonArray>();

        for (uint8_t i = 0; i < MAX_TRACKERS; i++) {
            if (trackers[i].valid) {
                JsonObject t = arr.add<JsonObject>();
                t["name"] = trackers[i].name;
                t["symbol"] = trackers[i].symbol;
                t["value"] = trackers[i].currentValue;
                t["change"] = trackers[i].changePercent;
                unsigned long ageMs = millis() - trackers[i].lastUpdate;
                const AppItem* trackerApp = trackerFindApp(trackers[i].name);
                t["age"] = ageMs / 1000;
                t["stale"] = appIsStale(trackerApp);
                if (trackerApp) {
                    t["staleAfter"] = trackerApp->staleAfter / 1000;
                    t["staleBehavior"] = staleBehaviorName(trackerApp->staleBehavior);
                }
            }
        }
        doc["count"] = trackerCount;

        String output;
        serializeJson(doc, output);
        request->send(200, "application/json", output);
    });

    // GET /api/tracker?name=btc - Get single tracker data
    webServer.on("/api/tracker", HTTP_GET, [](AsyncWebServerRequest *request) {
        if (!request->hasParam("name")) {
            request->send(400, "application/json", "{\"error\":\"Missing tracker name\"}");
            return;
        }

        String name = request->getParam("name")->value();
        TrackerData* tracker = trackerFind(name.c_str());

        if (!tracker) {
            request->send(404, "application/json", "{\"error\":\"Tracker not found\"}");
            return;
        }

        JsonDocument doc;
        doc["name"] = tracker->name;
        doc["symbol"] = tracker->symbol;
        doc["icon"] = tracker->icon;
        doc["currency"] = tracker->currencySymbol;
        doc["value"] = tracker->currentValue;
        doc["change"] = tracker->changePercent;
        char symbolColorHex[8];
        formatColorHex(tracker->symbolColor, symbolColorHex, sizeof(symbolColorHex));
        doc["symbolColor"] = symbolColorHex;
        char sparklineColorHex[8];
        formatColorHex(tracker->sparklineColor, sparklineColorHex, sizeof(sparklineColorHex));
        doc["sparklineColor"] = sparklineColorHex;
        JsonObject trackerObj = doc.as<JsonObject>();
        serializeTextField(trackerObj, "bottomText", tracker->bottomText,
                           tracker->bottomTextSegments, tracker->bottomTextSegmentCount);
        doc["sparklinePeriod"] = tracker->sparklinePeriod;

