nicolas-codemate/esp32-pixelcast/src/main.cpp
        unsigned long ageMs = millis() - tracker->lastUpdate;
        const AppItem* trackerApp = trackerFindApp(tracker->name);
        doc["age"] = ageMs / 1000;
        doc["stale"] = appIsStale(trackerApp);
        if (trackerApp) {
            doc["staleAfter"] = trackerApp->staleAfter / 1000;
            doc["staleBehavior"] = staleBehaviorName(trackerApp->staleBehavior);
        }

        if (tracker->sparklineCount > 0) {
            JsonArray sparkArr = doc["sparkline"].to<JsonArray>();
            for (uint8_t i = 0; i < tracker->sparklineCount; i++) {
                sparkArr.add(tracker->sparkline[i]);
            }
        }

        String output;
        serializeJson(doc, output);
        request->send(200, "application/json", output);
    });

    // DELETE /api/tracker?name=btc - Remove tracker
    webServer.on("/api/tracker", HTTP_DELETE, [](AsyncWebServerRequest *request) {
        if (!request->hasParam("name")) {
            request->send(400, "application/json", "{\"error\":\"Missing tracker name\"}");
            return;
        }

        String name = request->getParam("name")->value();
        if (trackerRemove(name.c_str())) {
            request->send(200, "application/json", "{\"success\":true}");
        } else {
            request->send(404, "application/json", "{\"error\":\"Tracker not found\"}");
        }
    });

    // POST /api/tracker?name=btc - Create/update tracker
    AsyncCallbackJsonWebHandler* trackerHandler = new AsyncCallbackJsonWebHandler("/api/tracker",
        [](AsyncWebServerRequest *request, JsonVariant &json) {
            Serial.println("[API] /tracker handler called");
            JsonObject doc = json.as<JsonObject>();

            if (doc.isNull()) {
                request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
                return;
            }

            // Get tracker name from query param or JSON
            String name;
            if (request->hasParam("name")) {
                name = request->getParam("name")->value();
            } else if (!doc["name"].isNull()) {
                name = doc["name"].as<String>();
            } else {
                request->send(400, "application/json", "{\"error\":\"Missing tracker name\"}");
                return;
            }

            // Allocate or find existing tracker
            TrackerData* tracker = trackerAllocate(name.c_str());
            if (!tracker) {
                request->send(500, "application/json", "{\"error\":\"No tracker slot available\"}");
                return;
            }

            trackerApplyJsonFields(tracker, doc);

            tracker->lastUpdate = millis();

            uint32_t staleAfter = TRACKER_DEFAULT_STALE_AFTER;
            if (!doc["staleAfter"].isNull()) {
                staleAfter = staleAfterSecondsToMillis(doc["staleAfter"].as<uint32_t>());
            }

            StaleBehavior staleBehavior = STALE_DIM;
            if (!doc["staleBehavior"].isNull() &&
                !parseStaleBehavior(doc["staleBehavior"], &staleBehavior)) {
                request->send(400, "application/json",
                    "{\"error\":\"staleBehavior must be hide, dim, badge or none\"}");
                return;
            }

            // Register/update app in rotation
            char appId[32];
            snprintf(appId, sizeof(appId), "%s%s", TRACKER_ID_PREFIX, name.c_str());
            uint16_t duration = doc["duration"] | (uint16_t)DEFAULT_APP_DURATION;
            int8_t appIndex = appAdd(appId, tracker->symbol, tracker->icon, 0xFFFFFF,
                                     duration, staleAfter, false);
            if (appIndex >= 0) {
                apps[appIndex].staleBehavior = staleBehavior;
            }

            Serial.printf("[TRACKER] Updated: %s (%s = %.2f)\n",
                         name.c_str(), tracker->symbol, tracker->currentValue);
            request->send(200, "application/json", "{\"success\":true}");
        });
    webServer.addHandler(trackerHandler);

    // ========================================================================
    // Sleep API
    // ========================================================================

    webServer.on("/api/sleep", HTTP_GET, [](AsyncWebServerRequest *request)
    {
        Serial.println("[API] /sleep GET");

        JsonDocument doc;
        bool active = sleepIsActive();
        doc["sleeping"] = active;
        if (active)
        {
            doc["reason"] = sleepReasonToString(lastSleepReason);
            if (lastSleepReason == SLEEP_REASON_OVERRIDE)
            {
                doc["until"] = settings.sleep.sleepUntilEpoch;
            }
        }
        else if (lastSleepReason == SLEEP_REASON_NTP_NOT_SYNCED)
        {
            doc["reason"] = sleepReasonToString(lastSleepReason);
        }
        buildSleepConfigJson(doc["config"].to<JsonObject>());

        String output;
        serializeJson(doc, output);
        request->send(200, "application/json", output);
    });

    AsyncCallbackJsonWebHandler *sleepHandler = new AsyncCallbackJsonWebHandler(
        "/api/sleep",
        [](AsyncWebServerRequest *request, JsonVariant &json)
        {
            Serial.println("[API] /sleep POST");

            JsonObject body = json.as<JsonObject>();
            if (body.isNull())
            {
                request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
                return;
            }

            String errorMessage;
            if (!applySleepUpdate(body, errorMessage))
            {
                JsonDocument errorDoc;
                errorDoc["error"] = errorMessage;
                String output;
                serializeJson(errorDoc, output);
                request->send(400, "application/json", output);
                return;
            }
            request->send(200, "application/json", "{\"success\":true}");
        });
    webServer.addHandler(sleepHandler);

    webServer.on("/api/sleep/wake", HTTP_POST, [](AsyncWebServerRequest *request)
    {
        Serial.println("[API] /sleep/wake POST");
        wakeNow();
        request->send(200, "application/json", "{\"success\":true}");
    });

    // ========================================================================
    // Notification API
    // ========================================================================

    // POST /api/notify/dismiss - Dismiss current notification
    // IMPORTANT: Must be registered BEFORE /api/notify JSON handler to avoid prefix match
    webServer.on("/api/notify/dismiss", HTTP_POST, [](AsyncWebServerRequest *request) {
        if (notifDismiss()) {
            resetNotifScrollState();
            request->send(200, "application/json", "{\"success\":true}");
        } else {
            request->send(404, "application/json", "{\"error\":\"No active notification\"}");
        }
    });

    // GET /api/notify/list - List all active notifications
    // IMPORTANT: Must be registered BEFORE /api/notify JSON handler to avoid prefix match
    webServer.on("/api/notify/list", HTTP_GET, [](AsyncWebServerRequest *request) {
        JsonDocument doc;
        doc["count"] = notificationCount;
        doc["currentIndex"] = currentNotifIndex;

