nicolas-codemate/esp32-pixelcast/src/main.cpp
    mqttClient.setServer(settings.mqttServer, settings.mqttPort);
    mqttClient.setCallback(mqttCallback);
    mqttClient.setBufferSize(MQTT_BUFFER_SIZE);
    mqttClient.setKeepAlive(MQTT_KEEPALIVE);

    Serial.printf("[MQTT] Configured: %s:%d (prefix: %s)\n",
                  settings.mqttServer, settings.mqttPort, settings.mqttPrefix);

    mqttConnect();
}

bool mqttConnect() {
    if (!settings.mqttEnabled || strlen(settings.mqttServer) == 0) {
        return false;
    }

    // Build LWT topic
    char lwtTopic[96];
    snprintf(lwtTopic, sizeof(lwtTopic), "%s%s", settings.mqttPrefix, MQTT_TOPIC_STATUS);

    // Build unique client ID from MAC address
    char clientId[32];
    uint64_t mac = ESP.getEfuseMac();
    snprintf(clientId, sizeof(clientId), "pixelcast_%04X%08X",
             (uint16_t)(mac >> 32), (uint32_t)mac);

    Serial.printf("[MQTT] Connecting as %s...\n", clientId);

    bool connected = false;
    if (strlen(settings.mqttUser) > 0) {
        connected = mqttClient.connect(clientId, settings.mqttUser, settings.mqttPassword,
                                       lwtTopic, 0, true, "offline");
    } else {
        connected = mqttClient.connect(clientId, lwtTopic, 0, true, "offline");
    }

    if (connected) {
        mqttConnected = true;
        lastMqttReconnectAttempt = millis();

        // Publish online status (retained)
        mqttClient.publish(lwtTopic, "online", true);

        // Subscribe to all topics under prefix
        char subscribeTopic[96];
        snprintf(subscribeTopic, sizeof(subscribeTopic), "%s/#", settings.mqttPrefix);
        mqttClient.subscribe(subscribeTopic);

        Serial.printf("[MQTT] Connected, subscribed to %s\n", subscribeTopic);
        return true;
    } else {
        mqttConnected = false;
        Serial.printf("[MQTT] Connection failed, rc=%d\n", mqttClient.state());
        lastMqttReconnectAttempt = millis();
        return false;
    }
}

void loopMQTT() {
    if (!settings.mqttEnabled || !wifiConnected) return;

    if (mqttClient.connected()) {
        mqttClient.loop();

        // Periodic stats publish
        if (millis() - lastStatsPublish > MQTT_STATS_INTERVAL) {
            mqttPublishStats();
            lastStatsPublish = millis();
        }
    } else {
        mqttConnected = false;

        // Reconnect with delay
        if (millis() - lastMqttReconnectAttempt > MQTT_RECONNECT_DELAY) {
            Serial.println("[MQTT] Attempting reconnection...");
            mqttConnect();
        }
    }
}

void mqttCallback(char* topic, byte* payload, unsigned int length) {
    Serial.printf("[MQTT] Message on topic: %s (%d bytes)\n", topic, length);

    // Strip prefix to get relative topic
    size_t prefixLen = strlen(settings.mqttPrefix);
    if (strncmp(topic, settings.mqttPrefix, prefixLen) != 0) {
        Serial.println("[MQTT] Ignoring message outside prefix");
        return;
    }
    const char* relativeTopic = topic + prefixLen;

    // Ignore outgoing-only topics
    if (strcmp(relativeTopic, MQTT_TOPIC_STATS) == 0 ||
        strcmp(relativeTopic, MQTT_TOPIC_STATUS) == 0) {
        return;
    }

    // Topics that need no JSON payload
    if (strcmp(relativeTopic, MQTT_TOPIC_DISMISS) == 0) {
        mqttHandleDismiss();
        return;
    }
    if (strcmp(relativeTopic, MQTT_TOPIC_REBOOT) == 0) {
        mqttHandleReboot();
        return;
    }
    if (strcmp(relativeTopic, MQTT_TOPIC_WAKE) == 0) {
        wakeNow();
        return;
    }

    // Parse JSON payload for all other topics
    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, payload, length);
    if (error) {
        Serial.printf("[MQTT] JSON parse error: %s\n", error.c_str());
        return;
    }
    JsonObject obj = doc.as<JsonObject>();

    // Route to handler based on relative topic
    if (strcmp(relativeTopic, MQTT_TOPIC_NOTIFY) == 0) {
        mqttHandleNotify(obj);
    } else if (strcmp(relativeTopic, MQTT_TOPIC_BRIGHTNESS) == 0) {
        mqttHandleBrightness(obj);
    } else if (strcmp(relativeTopic, MQTT_TOPIC_SETTINGS) == 0) {
        mqttHandleSettings(obj);
    } else if (strcmp(relativeTopic, MQTT_TOPIC_WEATHER) == 0) {
        mqttHandleWeather(obj);
    } else if (strcmp(relativeTopic, MQTT_TOPIC_CUSTOM) == 0) {
        // /custom with name in JSON body
        const char* name = obj["name"] | "";
        if (strlen(name) > 0) {
            if (obj["delete"] | false) {
                mqttHandleCustomDelete(name);
            } else {
                mqttHandleCustom(name, obj);
            }
        } else {
            Serial.println("[MQTT] /custom missing name");
        }
    } else if (strncmp(relativeTopic, MQTT_TOPIC_CUSTOM "/", strlen(MQTT_TOPIC_CUSTOM) + 1) == 0) {
        // /custom/{name}
        const char* name = relativeTopic + strlen(MQTT_TOPIC_CUSTOM) + 1;
        if (strlen(name) > 0) {
            if (obj["delete"] | false) {
                mqttHandleCustomDelete(name);
            } else {
                mqttHandleCustom(name, obj);
            }
        }
    } else if (strcmp(relativeTopic, MQTT_TOPIC_TRACKER) == 0) {
        // /tracker with name in JSON body
        const char* name = obj["name"] | "";
        if (strlen(name) > 0) {
            if (obj["delete"] | false) {
                mqttHandleTrackerDelete(name);
            } else {
                mqttHandleTracker(name, obj);
            }
        } else {
            Serial.println("[MQTT] /tracker missing name");
        }
    } else if (strncmp(relativeTopic, MQTT_TOPIC_TRACKER "/", strlen(MQTT_TOPIC_TRACKER) + 1) == 0) {
        // /tracker/{name}
        const char* name = relativeTopic + strlen(MQTT_TOPIC_TRACKER) + 1;
        if (strlen(name) > 0) {
            if (obj["delete"] | false) {
                mqttHandleTrackerDelete(name);
            } else {
                mqttHandleTracker(name, obj);
            }
        }
    } else if (strncmp(relativeTopic, MQTT_TOPIC_INDICATOR, strlen(MQTT_TOPIC_INDICATOR)) == 0) {
        // /indicator1, /indicator2, /indicator3
        const char* indexStr = relativeTopic + strlen(MQTT_TOPIC_INDICATOR);
        int idx = atoi(indexStr);
        if (idx >= 1 && idx <= NUM_INDICATORS) {
            mqttHandleIndicator(idx - 1, obj);
        } else {
            Serial.printf("[MQTT] Invalid indicator index: %s\n", indexStr);
        }
    } else if (strcmp(relativeTopic, MQTT_TOPIC_SLEEP) == 0) {
        if (!obj["until"].is<unsigned long>() && !obj["until"].is<long>()) {
            Serial.println("[MQTT] /sleep payload missing or non-integer 'until'");
            return;
        }
        uint32_t requestedUntil = obj["until"].as<uint32_t>();
        JsonDocument overrideDoc;
        JsonObject overrideBody = overrideDoc.to<JsonObject>();
        overrideBody["sleep_until"] = requestedUntil;
        String errorMessage;
        if (!applySleepUpdate(overrideBody, errorMessage)) {
            Serial.printf("[MQTT] /sleep rejected (until=%lu): %s\n",
                          (unsigned long)requestedUntil, errorMessage.c_str());
        }
    } else {
        Serial.printf("[MQTT] Unknown topic: %s\n", relativeTopic);
    }
}

void mqttPublishStats() {
    if (!mqttConnected) return;

    JsonDocument doc;
    doc["uptime"] = millis() / 1000;
    doc["freeHeap"] = ESP.getFreeHeap();
    doc["brightness"] = currentBrightness;
    doc["rssi"] = WiFi.RSSI();
    doc["appCount"] = appCount;
    doc["version"] = VERSION_STRING;

    if (currentAppIndex >= 0 && currentAppIndex < appCount) {
        doc["currentApp"] = apps[currentAppIndex].id;
    }

    char fullTopic[96];
    snprintf(fullTopic, sizeof(fullTopic), "%s%s", settings.mqttPrefix, MQTT_TOPIC_STATS);

    String payload;
    serializeJson(doc, payload);
    mqttClient.publish(fullTopic, payload.c_str());
}

// --- MQTT Topic Handlers ---

void mqttHandleBrightness(JsonObject& doc) {
    if (doc["brightness"].isNull()) {
        Serial.println("[MQTT] /brightness missing brightness value");
        return;
    }

