nicolas-codemate/esp32-pixelcast/src/main.cpp
    JsonObject current = doc["current"];
    strlcpy(weatherData.currentIcon, current["icon"] | "", sizeof(weatherData.currentIcon));
    weatherData.currentTemp = current["temp"] | 0;
    weatherData.currentTempMin = current["temp_min"] | 0;
    weatherData.currentTempMax = current["temp_max"] | 0;
    weatherData.currentHumidity = current["humidity"] | 0;

    // Parse forecast (optional, up to MAX_FORECAST_DAYS days)
    if (doc["forecast"].is<JsonArray>()) {
        JsonArray forecastArr = doc["forecast"];
        int forecastSize = min((int)forecastArr.size(), (int)MAX_FORECAST_DAYS);
        for (int i = 0; i < forecastSize; i++) {
            JsonObject fc = forecastArr[i];
            strlcpy(weatherData.forecast[i].icon, fc["icon"] | "", sizeof(weatherData.forecast[i].icon));
            weatherData.forecast[i].tempMin = fc["temp_min"] | 0;
            weatherData.forecast[i].tempMax = fc["temp_max"] | 0;
            strlcpy(weatherData.forecast[i].dayName, fc["day"] | "", sizeof(weatherData.forecast[i].dayName));
        }
        weatherData.forecastCount = forecastSize;
    } else {
        weatherData.forecastCount = 0;
    }

    weatherParseTodayBlock(doc["today"].as<JsonObjectConst>());

    uint32_t staleAfter = WEATHER_DEFAULT_STALE_AFTER;
    if (!doc["staleAfter"].isNull()) {
        staleAfter = staleAfterSecondsToMillis(doc["staleAfter"].as<uint32_t>());
    }

    StaleBehavior staleBehavior = STALE_HIDE;
    if (!doc["staleBehavior"].isNull() &&
        !parseStaleBehavior(doc["staleBehavior"], &staleBehavior)) {
        Serial.println("[MQTT] Unknown staleBehavior, keeping hide");
    }
    if (staleBehavior == STALE_DIM || staleBehavior == STALE_BADGE) {
        Serial.println("[MQTT] staleBehavior dim and badge need a tracker app, keeping hide");
        staleBehavior = STALE_HIDE;
    }
    weatherClockApplyStalePolicy(staleAfter, staleBehavior);

    // Reset forecast pagination on new data
    forecastPage = 0;
    lastForecastPageSwitch = millis();

    weatherData.lastUpdate = millis();
    weatherData.valid = true;

    Serial.printf("[MQTT] Weather updated: %d C, %d%% humidity\n",
                  weatherData.currentTemp, weatherData.currentHumidity);
}

void mqttHandleTracker(const char* name, JsonObject& doc) {
    // Allocate or find existing tracker
    TrackerData* tracker = trackerAllocate(name);
    if (!tracker) {
        Serial.printf("[MQTT] No tracker slot available for '%s'\n", name);
        return;
    }

    trackerApplyJsonFields(tracker, doc);

    tracker->lastUpdate = millis();

    uint32_t staleAfter = TRACKER_DEFAULT_STALE_AFTER;
    if (!doc["staleAfter"].isNull()) {
        staleAfter = staleAfterSecondsToMillis(doc["staleAfter"].as<uint32_t>());
    }

    StaleBehavior staleBehavior = STALE_DIM;
    if (!doc["staleBehavior"].isNull() &&
        !parseStaleBehavior(doc["staleBehavior"], &staleBehavior)) {
        Serial.println("[MQTT] Unknown staleBehavior, keeping dim");
    }

    // Register/update app in rotation
    char appId[32];
    snprintf(appId, sizeof(appId), "%s%s", TRACKER_ID_PREFIX, name);
    uint16_t duration = doc["duration"] | (uint16_t)DEFAULT_APP_DURATION;
    int8_t appIndex = appAdd(appId, tracker->symbol, tracker->icon, 0xFFFFFF,
                             duration, staleAfter, false);
    if (appIndex >= 0) {
        apps[appIndex].staleBehavior = staleBehavior;
    }

    Serial.printf("[MQTT] Tracker updated: %s (%s = %.2f)\n",
                  name, tracker->symbol, tracker->currentValue);
}

void mqttHandleTrackerDelete(const char* name) {
    if (trackerRemove(name)) {
        Serial.printf("[MQTT] Tracker '%s' deleted\n", name);
    } else {
        Serial.printf("[MQTT] Tracker '%s' not found\n", name);
    }
}

void mqttHandleSettings(JsonObject& doc) {
    if (!doc["brightness"].isNull()) {
        settings.brightness = doc["brightness"].as<uint8_t>();
        displaySetBrightness(settings.brightness);
    }
    if (!doc["autoRotate"].isNull()) {
        settings.autoRotate = doc["autoRotate"].as<bool>();
        appRotationEnabled = settings.autoRotate;
    }
    if (!doc["defaultDuration"].isNull()) {
        settings.defaultDuration = doc["defaultDuration"].as<uint16_t>();
    }
    if (!doc["weatherDuration"].isNull()) {
        uint32_t requestedWeatherDuration = doc["weatherDuration"].as<uint32_t>();
        settings.weatherDuration = constrain(requestedWeatherDuration,
                                             (uint32_t)MIN_WEATHER_DURATION,
                                             (uint32_t)MAX_WEATHER_DURATION);
        weatherClockApplyDuration(settings.weatherDuration);
    }

    saveSettings();
    Serial.println("[MQTT] Settings updated");
}

void mqttHandleReboot() {
    Serial.println("[MQTT] Reboot requested");
    pendingReboot = true;
    rebootRequestTime = millis();
}

// ============================================================================
// Filesystem Functions
// ============================================================================

void setupFilesystem() {
    if (!LittleFS.begin(true)) {
        Serial.println("[FS] LittleFS mount failed!");
        filesystemReady = false;
        return;
    }

    filesystemReady = true;
    Serial.printf("[FS] LittleFS mounted, total: %d bytes, used: %d bytes\n",
        LittleFS.totalBytes(), LittleFS.usedBytes());

    ensureDirectories();
}

bool ensureDirectories() {
    if (!filesystemReady) return false;

    const char* dirs[] = {FS_ICONS_PATH, FS_GIFS_PATH, FS_CONFIG_PATH};
    bool allOk = true;

    for (const char* dir : dirs) {
        if (!LittleFS.exists(dir)) {
            if (LittleFS.mkdir(dir)) {
                Serial.printf("[FS] Created directory: %s\n", dir);
            } else {
                Serial.printf("[FS] Failed to create directory: %s\n", dir);
                allOk = false;
            }
        }
    }

    return allOk;
}

void initDefaultSettings() {
    settings.brightness = DEFAULT_BRIGHTNESS;
    settings.autoRotate = true;
    settings.defaultDuration = DEFAULT_APP_DURATION;
    settings.weatherDuration = DEFAULT_WEATHER_DURATION;

    strlcpy(settings.ntpServer, NTP_SERVER, sizeof(settings.ntpServer));
    strlcpy(settings.tzPosix, DEFAULT_TZ_POSIX, sizeof(settings.tzPosix));

