nicolas-codemate/esp32-pixelcast/src/main.cpp
    for (int day = 0; day < 7; day++) {
        String dayKey = String(day);
        JsonObject dayObj = doc["sleep"]["days"][dayKey];

        settings.sleep.days[day].allDay = false;
        settings.sleep.days[day].slotCount = 0;

        if (dayObj.isNull()) continue;

        settings.sleep.days[day].allDay = dayObj["allDay"] | false;

        JsonArray slotsArr = dayObj["slots"];
        uint8_t loadedSlotCount = 0;
        for (JsonObject slotObj : slotsArr) {
            if (loadedSlotCount >= MAX_SLOTS_PER_DAY) break;
            uint8_t startHour   = slotObj["startHour"]   | 0;
            uint8_t startMinute = slotObj["startMinute"] | 0;
            uint8_t endHour     = slotObj["endHour"]     | 0;
            uint8_t endMinute   = slotObj["endMinute"]   | 0;
            if (startHour > 23 || endHour > 23 || startMinute > 59 || endMinute > 59) {
                Serial.printf("[SLEEP] Skipping invalid slot day=%d (%02u:%02u-%02u:%02u)\n",
                              day, startHour, startMinute, endHour, endMinute);
                continue;
            }
            SleepSlot& slot = settings.sleep.days[day].slots[loadedSlotCount];
            slot.startHour   = startHour;
            slot.startMinute = startMinute;
            slot.endHour     = endHour;
            slot.endMinute   = endMinute;
            loadedSlotCount++;
        }
        settings.sleep.days[day].slotCount = loadedSlotCount;
    }

    Serial.printf("[SLEEP] Loaded schedule: enabled=%d, displayMode=%s, override=%u\n",
                  settings.sleep.enabled,
                  settings.sleep.displayMode,
                  settings.sleep.sleepUntilEpoch);

    Serial.println("[SETTINGS] Configuration loaded successfully");
    Serial.printf("[SETTINGS] Brightness: %d, AutoRotate: %s\n",
                  settings.brightness, settings.autoRotate ? "true" : "false");

    return true;
}

bool saveSettings() {
    if (!filesystemReady) {
        Serial.println("[SETTINGS] Filesystem not ready");
        return false;
    }

    JsonDocument doc;

    // Display settings
    doc["display"]["brightness"] = settings.brightness;
    doc["display"]["autoRotate"] = settings.autoRotate;
    doc["display"]["defaultDuration"] = settings.defaultDuration;
    doc["display"]["colorDepth"] = COLOR_DEPTH;
    doc["display"]["transition"] = "none";

    // WiFi settings
    doc["wifi"]["hostname"] = MDNS_NAME;

    // NTP settings
    doc["ntp"]["server"] = settings.ntpServer;
    doc["ntp"]["tz_posix"] = settings.tzPosix;

    // WeatherClock app settings
    doc["apps"]["weatherclock"]["duration"] = settings.weatherDuration;

    // Clock app settings
    doc["apps"]["clock"]["enabled"] = settings.clockEnabled;
    doc["apps"]["clock"]["format24h"] = settings.clockFormat24h;
    doc["apps"]["clock"]["showSeconds"] = settings.clockShowSeconds;
    char clockColorHex[8];
    formatColorHex(settings.clockColor, clockColorHex, sizeof(clockColorHex));
    doc["apps"]["clock"]["color"] = clockColorHex;

    // Date app settings
    doc["apps"]["date"]["enabled"] = settings.dateEnabled;
    doc["apps"]["date"]["format"] = settings.dateFormat;
    char dateColorHex[8];
    formatColorHex(settings.dateColor, dateColorHex, sizeof(dateColorHex));
    doc["apps"]["date"]["color"] = dateColorHex;

    // MQTT settings
    doc["mqtt"]["enabled"] = settings.mqttEnabled;
    doc["mqtt"]["server"] = settings.mqttServer;
    doc["mqtt"]["port"] = settings.mqttPort;
    doc["mqtt"]["user"] = settings.mqttUser;
    doc["mqtt"]["password"] = settings.mqttPassword;
    doc["mqtt"]["prefix"] = settings.mqttPrefix;

    // Indicators
    for (int i = 0; i < NUM_INDICATORS; i++) {
        String key = String(i + 1);
        const char* modeStr = "off";
        switch (indicators[i].mode) {
            case INDICATOR_SOLID: modeStr = "solid"; break;
            case INDICATOR_BLINK: modeStr = "blink"; break;
            case INDICATOR_FADE:  modeStr = "fade";  break;
            default: break;
        }
        doc["indicators"][key]["mode"] = modeStr;
        char indicatorColorHex[8];
        formatColorHex(indicators[i].color, indicatorColorHex, sizeof(indicatorColorHex));
        doc["indicators"][key]["color"] = indicatorColorHex;
        doc["indicators"][key]["blinkInterval"] = indicators[i].blinkInterval;
        doc["indicators"][key]["fadePeriod"] = indicators[i].fadePeriod;
    }

    // Sleep settings
    doc["sleep"]["enabled"] = settings.sleep.enabled;
    doc["sleep"]["displayMode"] = settings.sleep.displayMode;
    doc["sleep"]["sleepUntilEpoch"] = settings.sleep.sleepUntilEpoch;

    for (int day = 0; day < 7; day++) {
        String dayKey = String(day);
        doc["sleep"]["days"][dayKey]["allDay"] = settings.sleep.days[day].allDay;

        JsonArray slotsArr = doc["sleep"]["days"][dayKey]["slots"].to<JsonArray>();
        for (uint8_t slotIndex = 0; slotIndex < settings.sleep.days[day].slotCount; slotIndex++) {
            const SleepSlot& slot = settings.sleep.days[day].slots[slotIndex];
            JsonObject slotObj = slotsArr.add<JsonObject>();
            slotObj["startHour"]   = slot.startHour;
            slotObj["startMinute"] = slot.startMinute;
            slotObj["endHour"]     = slot.endHour;
            slotObj["endMinute"]   = slot.endMinute;
        }
    }

    File file = LittleFS.open(FS_CONFIG_FILE, "w");
    if (!file) {
        Serial.println("[SETTINGS] Failed to open config file for writing");
        return false;
    }

    serializeJsonPretty(doc, file);
    file.close();

    Serial.println("[SETTINGS] Configuration saved successfully");
    return true;
}

// ============================================================================
// Application Manager Functions
// ============================================================================

void setupApps() {
    // Initialize app array
    memset(apps, 0, sizeof(apps));
    appCount = 0;
    currentAppIndex = -1;

    // Add system apps
    // NOTE: clock and date disabled while weatherclock is in development
    // if (settings.clockEnabled) {
    //     appAdd("clock", "Clock", "", settings.clockColor,
    //            settings.defaultDuration, 0, true);
    //     Serial.println("[APPS] Clock app added");
    // }
    //
    // if (settings.dateEnabled) {
    //     appAdd("date", "Date", "", settings.dateColor,
    //            settings.defaultDuration, 0, true);
    //     Serial.println("[APPS] Date app added");
    // }

    // WeatherClock system app (replaces clock+date when weather data is available)
    appAdd("weatherclock", "WeatherClock", "", settings.clockColor,
           settings.weatherDuration, 0, true);
    Serial.println("[APPS] WeatherClock app added");

    Serial.printf("[APPS] Initialized with %d apps\n", appCount);
    appRotationEnabled = settings.autoRotate;
}

int8_t appAdd(const char* id, const char* text, const char* icon,
              uint32_t textColor, uint16_t duration,
              uint32_t staleAfter, bool isSystem) {

    // Check if app with same ID exists
    int8_t existingIndex = appFind(id);
    if (existingIndex >= 0) {
        // Update existing app
        AppItem* app = &apps[existingIndex];
        strlcpy(app->text, text, sizeof(app->text));
        if (icon) strlcpy(app->icon, icon, sizeof(app->icon));
        app->label[0] = '\0';  // Reset label (caller will set if needed)
        app->textColor = textColor;
        app->textSegmentCount = 0;
        app->labelSegmentCount = 0;
        app->duration = duration;
        app->staleAfter = staleAfter;
        app->lastUpdate = millis();
        app->active = true;
        // Reset zone data (caller will set via appSetZones if needed)
        app->zoneCount = 0;
        memset(app->zones, 0, sizeof(app->zones));
        Serial.printf("[APPS] Updated app: %s\n", id);
        return existingIndex;
    }

    // Find empty slot
    int8_t emptySlot = -1;
    for (uint8_t i = 0; i < MAX_APPS; i++) {
        if (!apps[i].active) {
            emptySlot = i;
            break;
        }
    }

    if (emptySlot < 0) {
        Serial.println("[APPS] No empty slot available");
        return -1;
    }

