nicolas-codemate/esp32-pixelcast/src/main.cpp
    settings.sleep = scratch;
    saveSettings();
    loopSleepTransition();
    return true;
}

static void wakeNow()
{
    settings.sleep.sleepUntilEpoch = 0;
    saveSettings();
    loopSleepTransition();
    Serial.println("[SLEEP] Wake override cleared");
}

void loopDisplay() {
    if (!wifiConnected) return;

    if (sleepIsActive()) {
        if (strcmp(settings.sleep.displayMode, "clock") == 0) {
            unsigned long sleepNow = millis();
            if (sleepNow - lastDisplayUpdate > 1000) {
                displayShowTime();
                lastDisplayUpdate = sleepNow;
            }
        }
        return;
    }

    unsigned long now = millis();
    bool needsRedraw = false;

    // ---- Notification display (priority over apps) ----
    NotificationItem* currentNotif = notifGetCurrent();
    if (currentNotif) {
        needsRedraw = scrollStateAdvance(notifScrollState, now);

        // Redraw notification on scroll, periodic update, or indicator animation
        bool indicatorRedraw = indicatorNeedsRedraw() && (now - lastDisplayUpdate > 50);
        if (now - lastDisplayUpdate > 1000 || needsRedraw || indicatorRedraw) {
            displayShowNotification(currentNotif);
            lastDisplayUpdate = now;
        }
        return;  // Skip app display while notification is active
    }

    // ---- Normal app display ----
    AppItem* current = appGetCurrent();
    needsRedraw = false;

    // Handle scroll animation (50ms updates for smooth scrolling)
    if (current) {
        needsRedraw = scrollStateAdvance(appScrollState, now);
        needsRedraw |= scrollStateAdvance(trackerSymbolScrollState, now);
        needsRedraw |= scrollStateAdvance(trackerBottomScrollState, now);
    }

    // Regular display update (1000ms for non-scrolling, 50ms for indicator animation)
    bool indicatorRedraw = indicatorNeedsRedraw() && (now - lastDisplayUpdate > 50);
    if (now - lastDisplayUpdate > 1000 || needsRedraw || indicatorRedraw) {
        if (current) {
            displayShowApp(current);
        } else {
            // Fallback: show time if no apps
            displayShowTime();
        }
        lastDisplayUpdate = now;
    }
}

// ============================================================================
// Utility Functions
// ============================================================================

void logMemory() {
    Serial.printf("[MEM] Free heap: %d bytes, largest block: %d bytes\n",
        ESP.getFreeHeap(), ESP.getMaxAllocHeap());
}
